[
  {
    "slug": "maha-research",
    "title": "Iconographic Verification and Serendipitous Fieldwork: A Field Note on Identifying Deities in a Sichuan-Tibet Border Jingtang",
    "date": "2025-08-05",
    "type": "FIELD RESEARCH",
    "image": "/library/criticisms/maha-research/images/maha.jpg",
    "description": "This field note details an unexpected ethnographic encounter and iconographic verification process during a Sichuan-Tibet border journey. What began as a casual visit to Chuansi Temple and Gami Monastery culminated in a crucial, impromptu \"field investigation\" within a local homestay's private shrine room (Jīngtáng). The record traces the journey of identifying two key Buddhist images: the initial misidentification of a Yellow Jambhala (黄财神) relief, corrected through expert group chat verification by analyzing features such as the peaceful aspect and Jewel-Spitting Mongoose; and the subsequent analysis of a vibrant Five-Color Dakinis (五色空行母) thangka.",
    "content": "## Field Investigation Record\r\n\r\n**Origin: From Chuansi Temple to Gami Monastery, the Greatest Discovery Was in the Homestay**\r\n\r\nThe starting point of this event was my **Sichuan-Tibet Border Journey**, following the idea of exploring Tibetan Buddhism. I visited Chuansi Temple and Gami Monastery. However, the greatest discovery and the unexpected \"field investigation\" occurred in the **homestay** where I was staying.\r\n![gami temple](/library/criticisms/maha-research/images/gami1.jpg)\r\n![gami temple](/library/criticisms/maha-research/images/gami2.jpg)\r\n***\r\n\r\n### Phase I: Initial Identification of the Deity at the Entrance, Verification via Group Chat, and Color Correction\r\n\r\n1.  **Curiosity-Driven:** I became curious about the image of the deity hanging at the homestay’s entrance and asked the host about the name of the Buddha or Principal Deity (**Yidam**) (see Annotation 4).\r\n![maha](/library/criticisms/maha-research/images/maha.jpg)\r\n2.  **Host's Answer and Misunderstanding:** The host replied, \"Mahā.\" Due to my preliminary knowledge of Tibetan Buddhism, **\"Mahā\" led me to associate it with \"Mahākāla\" (玛哈嘎拉), the Great Black One** (see Annotation 1). I initially thought it was a Mahākāla image.\r\n3.  **Key Correction (Golden Relief):** As the discussion deepened, I reiterated the material of the original image: it was a **pure golden relief** (similar to a gilded relief). This information negated the color clue, making it impossible to directly determine the deity based on color alone.\r\n\r\n### Phase II: Verification Assisted by Group Members, Feature Analysis, and the Final Conclusion (Yellow Jambhala)\r\n\r\nThe discussion within the group centered on the deity's features: \"golden, two-armed, standing pose, peaceful countenance.\"\r\n\r\n*   **Exclusion of Mahākāla:** Group members pointed out that common Mahākālas are in the **wrathful aspect (忿怒相)** (see Annotation 5), whereas the image I provided had a **peaceful countenance** and **only two arms.** Thus, it could not be the common wrathful Mahākāla.\r\n![mahakala](/library/criticisms/maha-research/images/mahakala.jpg)\r\n*   **New Direction and Focus:** The discussion established that the deity possessed the general characteristics of a Wealth Deity: peaceful countenance, holding Dharma implements (**法物**), seated or standing posture. **Through the identification and confirmation of the core element, the \"Jewel-Spitting Mongoose (吐宝鼠),\" the focus narrowed down to Yellow Jambhala** (Tibetan: ཛམ་བྷ་ལ་སེར་པོ, *Dzambhala ser po*) (see Annotation 2).\r\n*   **Clarification of \"Mahā\":** The group also clarified that \"Mahā\" does not exclusively refer to Mahākāla; it can be a general reference to the great or profound quality of the Principal Deity.\r\n*   **Final Conclusion:** Combining the features—the deity was **golden**, had a **peaceful countenance**, and was **two-armed with held objects**—we ultimately determined that the image at the entrance was highly likely **Yellow Jambhala**, correcting my initial misunderstanding caused by the host's single word, \"Mahā.\"\r\n\r\n### Phase III: The Unexpected Surprise in the Homestay's Shrine Room and the Verification of the Second Thangka\r\n\r\n1.  **Deep Background of the Homestay:** Upon further inquiry, the host revealed that his **younger brother is the next abbot (住持) of Chuansi Temple**, which is why their family maintains **one of the best private shrine rooms (经堂, *Jīngtáng*) in the vicinity** (see Annotation 3).\r\n   ![jing](/library/criticisms/maha-research/images/jingtang.jpg)\r\n2.  **Unexpected Permission to Photograph:** I was granted permission to enter the shrine room and photograph most of the thangkas (I refrained from photographing individual statues out of respect). This collection of precious material far exceeded the documentation I obtained at the monasteries.\r\n3.  **Second Group Inquiry (Second Thangka):** I shared one of the vibrant, multi-faced, multi-armed thangkas with the group for a second round of verification.\r\n4.  **Group Discussion and Multi-Aspect Identification (Five-Color Dakinis):**\r\n   ![dakinis](/library/criticisms/maha-research/images/dakinis.jpg)\r\n    *   *Initial Guesses:* Initial guesses included **Vajrayoginī** (金刚亥母) (see Annotation 6), the Nine Dakinis, or **Uṣṇīṣavijayā** (尊胜佛母) (see Annotation 7).\r\n    *   *Confirmation:* Through careful observation, I confirmed that the thangka had **multiple faces stacked vertically**, and the color scheme matched the **Five Colors**.\r\n    *   *Final Tendency:* Ultimately, the discussion leaned toward confirming my observation that this thangka conformed to the representation of the **Five-Color Dakinis** (Tibetan: མཁའ་འགྲོ་མ་, *mkha' 'gro ma*). The discussion also touched upon the concepts of the Dakinis' **Peaceful Aspect (寂静相)** (see Annotation 5) and **Wrathful Aspect (忿怒相)**.\r\n\r\n***\r\n\r\n## Self-Summary and Reflection\r\n\r\nThis trip's greatest discoveries were not in the planned scenic spots but in the \"unexpected surprise\" within the homestay.\r\n\r\n*   **Academic Verification and Information Error:** I thank the all-knowledgeable group members; their expertise **corrected my initial misunderstanding of the first deity image** and **eliminated the initial misjudgment caused by the color displayed on my phone**, ultimately confirming it as **Yellow Jambhala**. This compensated for the unfortunate situation where the host himself was not fully knowledgeable about the deity worshipped in his own home.\r\n*   **Research Difficulty and Affinity/Karma (缘分):** I am deeply interested in the study of religious sociology, but I am aware that Chinese language materials on Tibetan Buddhism are difficult to collect, and the field is challenging for beginners. My lack of thorough preparation before the trip led to me feeling \"at a loss\" at the temple sites. However, obtaining this batch of **high-quality, context-rich thangka images** in the homestay, coupled with the professional assistance of the group members, felt like an **unexpected affinity and good karma**.\r\n*   **Motivation for Research:** This experience has greatly stimulated my interest in continuing to learn and research Tibetan Buddhism in depth. **From Chuansi Temple to Gami Monastery, the greatest discovery was in the homestay**—this has become the most profound memory of the trip.\r\n\r\n***\r\n\r\n## Annotations\r\n\r\n**Annotation 1: Mahākāla (玛哈嘎拉)**\r\n*   **Concept:** A prominent **Dharma Protector (Dharmapāla)** in Tibetan Buddhism (Sanskrit: *Mahākāla*), meaning \"Great Black One.\" He is primarily revered in his **wrathful aspect**, often depicted as multi-armed and typically black or deep blue in color.\r\n\r\n**Annotation 2: Yellow Jambhala (黄财神)**\r\n*   **Concept:** The most popular of the five Buddhist Wealth Deities (Tibetan: ཛམ་བྷ་ལ་སེར་པོ, *Dzambhala ser po*). He is depicted in a **peaceful aspect**, colored yellow or gold, and is characteristically shown holding a **Jewel-Spitting Mongoose** (*Nakula*) in his left hand, which symbolizes his ability to generate wealth and eliminate poverty.\r\n\r\n**Annotation 3: Jingtang (经堂)**\r\n*   **Concept:** The Chinese term (*Jīngtáng*) for a private or family shrine room/chapel in a Tibetan Buddhist home. It is a dedicated space for daily prayers, rituals, and the storage and display of religious art, such as statues and thangkas.\r\n\r\n**Annotation 4: Principal Deity (Yidam)**\r\n*   **Concept:** In Vajrayāna Buddhism, the Yidam (Tibetan: ཡི་དམ་, *yi dam*) is a tutelary or meditation \r\n  \r\n## Gallery\r\n\r\n![thangka](/library/criticisms/maha-research/images/thangka1.jpg)\r\n![thangka](/library/criticisms/maha-research/images/thangka2.jpg)\r\n![thangka](/library/criticisms/maha-research/images/thangka3.jpg)\r\n![thangka](/library/criticisms/maha-research/images/thangka4.jpg)\r\n![thangka](/library/criticisms/maha-research/images/thangka5.jpg)\r\n![thangka](/library/criticisms/maha-research/images/thangka6.jpg)\r\n![yamantaka](/library/criticisms/maha-research/images/yamantaka.jpg)"
  },
  {
    "slug": "cthulhu-borges",
    "title": "From Cthulhu to Borges: Cosmic Horror, Sublime Aesthetics, and Mythic Displacement in Modern Literature",
    "date": "2024-10-13",
    "type": "LECTURE",
    "image": "/library/criticisms/cthulhu-borges/image.jpg",
    "description": "This lecture explores the intellectual and aesthetic intersections between H.P. Lovecraft’s Cthulhu Mythos and Jorge Luis Borges’ literary oeuvre. It examines the 'horror sublime aesthetics' and the contemporary evolution of the Cthulhu Mythos in online literature through the framework of mythic displacement.",
    "content": "[SLIDES FOR LECTURE](/library/criticisms/cthulhu-borges/slide.pptx)\r\n\r\n## Introduction\r\n\r\nThis lecture undertakes a rigorous exploration of the intellectual and aesthetic intersections between H.P. Lovecraft’s Cthulhu Mythos and Jorge Luis Borges’ literary oeuvre, while examining the contemporary evolution of Cthulhu Mythos within online literature through the theoretical framework of mythic displacement. It transcends mere comparative analysis to uncover the foundational principles of \"horror sublime aesthetics,\" its philosophical origins, and its cross-cultural resonance across diverse literary traditions and historical periods.\r\n\r\nThe trajectory from Cthulhu to Borges illuminates humanity’s enduring engagement with existential fear, cognitive uncertainty, and the ineffable unknown. Lovecraft’s conception of a universe indifferent to human values and Borges’ labyrinthine narratives that destabilize the boundaries between reality and fiction both articulate a primal sense of awe and terror—core tenets of the horror sublime. In the digital age, Cthulhu Mythos has undergone a significant metamorphosis, merging with Chinese folk traditions and Western esotericism in online literary works, demonstrating its remarkable adaptability and timeless relevance. This report elaborates on each thematic segment of the lecture, articulating core arguments, theoretical underpinnings, and critical insights that structure the inquiry.\r\n\r\n## I. Borges and Cthulhu Mythos: The Sublime Aesthetics of Horror\r\n\r\n### 1. Core Traits of Horror Sublime Aesthetics\r\n\r\nHorror, as an autonomous category in Western aesthetic history, traces its roots to humanity’s primordial awe and trepidation in the face of untamed natural forces. In pre-modern eras, limited productive capacity left humans powerless to comprehend or confront phenomena such as storms, earthquakes, and floods, leading to the personification of these forces as divine wrath. The etymology of \"panic\"—derived from Pan, the Greek god of the wild—embodies this primal dread of the unknown. Horror sublime aesthetics, as explored herein, is defined by two interconnected traits: the interplay of darkness and immensity, and the blurring of reality and fiction.\r\n\r\n#### (1) Darkness and Immensity: Obscurity and the Sacred\r\n\r\nDarkness and immensity emerge as recurring motifs in both Borges and Lovecraft’s works, functioning as conduits for evoking the sacred and the unknowable. Borges frequently expressed a profound, indistinct unease toward everyday objects such as mirrors and bookcases, and his poetic and prose works are permeated with references to \"sacred fear\" or \"sacred terror.\" As noted by Osvaldo Ferrari, Borges invoked biblical cadence to assert that humanity cannot gaze upon the divine, for such a sight would bring annihilation. This thematic thread recurs in poems including \"A Thirteenth-Century Poet,\" where the future is shrouded in \"sacred fear,\" \"A Saxon,\" where fate bears the weight of the same emotion, and \"Rafael Cansinos-Asséns,\" where the protagonist is drawn to an inescapable \"sacred terror.\"\r\n\r\nIn Borges’ fiction, darkness operates not merely as setting but as a thematic device that underscores the limits of human perception. \"The Circular Ruins\" opens with an impenetrably dark night, as the protagonist lands ashore and enters a \"sacred swamp.\" In \"Funes the Memorious,\" darkness precedes the protagonist’s appearance and lingers until his death with the arrival of light. Immensity, meanwhile, manifests in structures of near-cosmic scale: the hexagonal library in \"The Library of Babel,\" virtually synonymous with the universe itself; the labyrinthine city of immortals in \"The Immortal\"; and the desert in \"The Two Kings and the Two Labyrinths.\" These spaces are physically vast and symbolically overwhelming, emphasizing humanity’s insignificance in the face of transcendent forces.\r\n\r\nLovecraft similarly deploys darkness and immensity to craft his signature cosmic horror. Within the Cthulhu Mythos, the \"indescribable\" and \"unnameable\" nature of the Old Ones stems from the inherent limitations of human experience and cognition. As Lovecraft writes in \"The Call of Cthulhu,\" these beings are \"free and wild and beyond good and evil, indifferent to morality and law.\" Their terror lies not in malevolence but in the dissolution of human ethical frameworks, reflecting the universe’s amoral essence. Works such as \"The Whisperer in Darkness\" feature chants that evoke cosmic vastness: \"From the black holes of the night sky to the harbors of the cosmos, and back again to the black holes of the night sky, we praise the great Cthulhu, praise Tsathoggua, praise the god whose name cannot be spoken.\" In \"Hypnos,\" the narrator describes a universe \"composed of dark entities and consciousness, deeper than matter, time, and space,\" while \"The Call of Cthulhu\" posits human existence as a fleeting accident within the cosmos’ grand cycle.\r\n\r\nTogether, darkness and immensity construct a sense of \"sacred dread\"—a term encapsulating the awe-inspiring terror of confronting phenomena that transcend human comprehension. Darkness shrouds the unknown, while immensity underscores the triviality of human life and thought, collectively challenging anthropocentric worldviews.\r\n\r\n#### (2) Reality and Fiction: The Terror of Cognitive Disruption\r\n\r\nA second defining trait of horror sublime aesthetics is the erosion of boundaries between reality and fiction, which induces profound cognitive dissonance and existential unease. Borges rejected the notion of an inherent distinction between fact and fiction, arguing that the two exist on a continuum. In \"The Aleph,\" the narrator glimpses the entire universe in a single point, observing \"all the mirrors of the world, but none reflecting me.\" This vision strips away possibility, fantasy, and expectation, undermining the narrator’s sense of self and ontological certainty. Similarly, \"The Garden of Forking Paths\" presents a multiverse of infinite parallel realities, where \"most of the time we do not exist; sometimes you exist without me; sometimes I exist without you; sometimes we both exist.\" This fragmentation of reality leaves characters and readers alike questioning the solidity of their own existence.\r\n\r\nBorges frequently quoted literary examples to illustrate this blurring, such as the 602nd night of \"The Thousand and One Nights,\" where storytellers and characters intersect, creating an infinite narrative loop. Similarly, in \"Don Quixote\" Part Two, the protagonist engages with the events of Part One, while Hamlet stages a play-within-a-play, collapsing the line between performance and reality. These intertextual gestures demonstrate how fiction infiltrates reality and vice versa, generating anxiety from the collapse of epistemological certainty.\r\n\r\nLovecraft explores analogous terrain in works like \"Through the Gates of the Silver Key,\" where Randolph Carter exists simultaneously across multiple times and dimensions: as a young boy in 1883, as a shadowy figure among the Old Ones in 1928, and as a being in the formless abyss beyond the Ultimate Gate. This multiplicity pushes Carter to the brink of madness, as he grapples with the dissolution of a unified self. The terror here originates not from external monstrosity but from the unraveling of identity and the realization that perceived reality may be an illusion.\r\n\r\nBoth authors use narrative to destabilize readers’ cognitive certainties, forcing confrontation with the fragility of human understanding. The question of what constitutes reality, when perception is unreliable and the self is not fixed, lies at the heart of horror sublime aesthetics, tapping into a primal fear of chaos and meaninglessness.\r\n\r\n### 2. Origins of Horror Sublime Aesthetics: Insomnia, Blindness, and Nightmares\r\n\r\nThe foundations of horror sublime aesthetics are deeply rooted in the personal experiences and thematic preoccupations of Borges and Lovecraft, particularly their engagement with insomnia, blindness, and nightmares. These elements shape their respective visions of cosmic terror, providing a psychological and philosophical framework for their explorations of the unknown.\r\n\r\nBorges, who suffered from chronic insomnia, conceptualized it as a \"regression to origins and the beginning of loneliness.\" In his essay \"Insomnia,\" he posits that \"In the sleepless nights, we relive the fears of our ancestors, a world we have forgotten but which haunts us like a memory.\" Insomnia strips away the comfort of routine and rationality, exposing individuals to primal fears long suppressed by civilization. Blindness, which Borges experienced in his later years, heightened his reliance on imagination and memory, further blurring the line between perception and fantasy. Nightmares, too, occupied a central place in his work; Borges described them as \"momentary glimpses of hell,\" and poems such as \"Dream\" and \"Nightmare\" vividly depict the terror of the unconscious. In \"The Circular Ruins,\" the protagonist creates another human through dreams, only to discover he himself may be a product of another’s dream—an nested structure reflecting Borges’ belief that human existence is akin to a nightmare, a meaningless cycle of creation and dissolution.\r\n\r\nLovecraft similarly drew inspiration from his own nightmares, with works like \"The Night Gaunt\" and \"Nyarlathotep\" emerging directly from these terrifying visions. \"The Dream-Quest of Unknown Kadath\" imagines the \"Dreamlands,\" a dimension accessible through dreams that mirrors the waking world but operates by irrational laws, where dreams hold the same ontological weight as reality. As American scholar Katherine Hayles observes, this reflexive structure—where a dreamer creates a being who is in turn dreamed by another, ad infinitum—generates an \"infinite regress\" that undermines all notions of origin and certainty.\r\n\r\nThese personal and thematic elements are not mere biographical curiosities but essential components of the horror sublime. By channeling the anxieties of insomnia, the disorientation of blindness, and the terror of nightmares, Borges and Lovecraft accessed universal human fears, translating them into literary form that resonates across cultures and generations.\r\n\r\n### 3. Lovecraft’s Influence on Borges\r\n\r\nWhile Borges and Lovecraft never collaborated and Borges encountered Lovecraft’s work later in life, the influence of Lovecraft’s ideas on Borges’ oeuvre is unmistakable. This section examines the shared motifs and cosmic philosophies that link the two authors, demonstrating how Borges absorbed, reimagined, and elevated Lovecraft’s cosmic horror.\r\n\r\nArchitectural motifs such as libraries and labyrinths stand as prominent points of convergence. In Lovecraft’s \"The Shadow Out of Time,\" the Great Race of Yith possesses a monumental library housing \"books and records that detail the entire history of Earth’s long ages, depicting every species and documenting all knowledge of their arts, achievements, languages, and psychology.\" Built to withstand catastrophic disasters, these libraries symbolize the endurance of knowledge in an indifferent universe. Borges’ \"The Library of Babel\" echoes this vision, describing a universe-sized library that outlasts humanity, \"illuminated by a single lamp, infinite and immobile, holding rare books, obscure, useless, and indestructible.\" Both libraries embody the overwhelming vastness of knowledge, a source of awe and terror in equal measure, as confronting infinite knowledge exposes the limits of human understanding.\r\n\r\nLabyrinths represent another shared motif: Lovecraft’s \"At the Mountains of Madness\" and \"The Nameless City\" depict grand, desolate stone cities that are labyrinthine in structure and meaning, while Borges’ \"The Immortal\" features a labyrinthine city built by immortals, a physical and metaphorical representation of existential complexity. Additionally, both authors created fictional books as gateways to the unknown: Lovecraft’s \"Necronomicon\" and Borges’ \"The Book of Sand,\" objects that symbolize forbidden knowledge capable of corrupting and destroying those who seek it.\r\n\r\nBeyond shared motifs, Borges and Lovecraft articulated nearly identical cosmic worldviews: a universe that is cyclical, infinite, and indifferent to human life—\"vast, inhuman, irrational, incomprehensible, and chaotic, like a labyrinth without a center.\" Borges’ \"The Aleph,\" a point containing the entire universe, echoes Lovecraft’s Yog-Sothoth, the \"All-in-One and One-in-All\" existing beyond time and space. Similarly, \"The Garden of Forking Paths\" and \"Through the Gates of the Silver Key\" both explore multiple realities and identity fragmentation, reflecting a shared fascination with the limits of human cognition.\r\n\r\nBorges openly acknowledged his admiration for Lovecraft, with his essay \"Unfinished\" opening with a tribute and adopting Lovecraft’s stylistic conventions. This influence underscores the transgressive power of Lovecraft’s ideas, which transcended literary boundaries to resonate with one of the 20th century’s most profound intellectual voices. Borges did not merely imitate Lovecraft; he synthesized Lovecraft’s cosmic horror with his own philosophical depth and linguistic precision, creating a unique hybrid that elevated both traditions.\r\n\r\n## II. The Modernization of Cthulhu Mythos: Mythic Displacement in Online Literature\r\n\r\n### 1. Mythic Archetype Theory and Mythic Displacement\r\n\r\nThe second segment of the lecture shifts focus to the contemporary transformation of Cthulhu Mythos, analyzing its adaptation in online literature through the lens of \"mythic displacement,\" a concept rooted in Northrop Frye’s Mythic Archetype Theory. This framework provides a critical tool for understanding how mythic structures and motifs are reimagined across diverse cultural contexts, literary genres, and historical periods.\r\n\r\nIn \"Anatomy of Criticism,\" Frye identifies five literary narrative modes: myth, romance, tragedy (high mimetic), comedy (low mimetic), and satire. For Frye, myth operates on two levels: first, as a narrative centered on gods, where the protagonist is \"superior both to other humans and to their environment\"; second, as an archetype—a foundational structure or motif that influences all subsequent narrative forms. Mythic archetypes are not static; instead, they undergo \"displacement\" as they are adapted to new cultural contexts, historical eras, and literary genres. This displacement may be \"concentric\" (remaining closely aligned with the original myth) or \"eccentric\" (diverging significantly), but it preserves the core essence of the archetype, enabling cross-cultural comparison and dialogue.\r\n\r\nFrye’s theory illuminates the adaptation of Cthulhu Mythos in online literature. Lovecraft’s original works are grounded in Western cultural traditions, exploring themes of cosmic indifference, forbidden knowledge, and the fragility of human sanity. In contemporary online literature—both in China and the West—these themes have been displaced into new cultural contexts, merging with local folklore, religious traditions, and literary conventions. This process of displacement preserves the core of Cthulhu Mythos while enriching it with new meanings, ensuring its relevance for contemporary readers.\r\n\r\nMythic archetypes transcend cultural boundaries, reflecting universal human experiences: fear of the unknown, anxiety about cosmic insignificance, and the struggle to maintain sanity in the face of incomprehensible forces. By applying Frye’s theory, we recognize Cthulhu Mythos as a modern mythic archetype, continuously reimagined to reflect the fears and anxieties of contemporary society.\r\n\r\n### 2. Cthulhu Mythos and Chinese Folk Customs: From \"The Flock of Ba-Hui\" to \"The Legend of the Strange Immortal\"\r\n\r\nA compelling example of mythic displacement is the fusion of Cthulhu Mythos with Chinese folk customs in online literature, exemplified by works such as \"The Flock of Ba-Hui\" and \"The Legend of the Strange Immortal\" (\"Dao Gui Yi Xian\"). These texts demonstrate how Lovecraft’s cosmic horror can be seamlessly integrated with Chinese cultural traditions, creating a distinct and potent literary experience.\r\n\r\n\"The Flock of Ba-Hui\" is the first Chinese Cthulhu work to be officially published domestically and internationally, drawing heavily on Sichuan folk legends. The author’s companion work, \"Black Tai Sui,\" similarly weaves Chinese folk beliefs into the Cthulhu framework, crafting monsters and deities that are culturally familiar to Chinese readers yet terrifying in the Lovecraftian tradition.\r\n\r\n\"The Legend of the Strange Immortal\" advances this fusion, featuring a protagonist who is both insane and immortal—a satirical subversion of the traditional Chinese immortal archetype. The novel is replete with examples of mythic displacement: \"Uncle You\" functions as a clear displacement of Lovecraft’s Hounds of Tindalos, while monsters such as Black Tai Sui and Ba-Hui reference \"Black Tai Sui\" and \"The Flock of Ba-Hui,\" creating intertextual continuity. At its core, the novel embodies Lovecraft’s foundational premise: human struggle and ambition are meaningless in the face of supernatural forces, and \"the common laws, interests, and emotions of humanity are nothing but void and meaningless in the vast universe.\"\r\n\r\nTo construct this fusion, the author draws on a diverse range of Chinese folk and religious traditions: Zoroastrianism and Nestorianism are merged into \"Ao-Jing Religion\"; White Lotus Sect and Tibetan Buddhism are referenced; Taoist concepts such as \"Three Flowers Gathered at the Top\" and \"Ascension to Immortality\" are subverted; and Chu culture’s primal mysticism is reflected in the use of \"Si Ming\" (Controller of Fate) to denote divine entities. The novel also incorporates a pantheon of deities and monsters from Chinese folklore, including Wu Sheng Lao Mu (Unborn Old Mother), Chang Sheng Tian (Eternal Heaven), Ba-Hui, Gu Shen (Ox God), Five Wisdom Tathagatas, Three Pure Ones, Da Hei Tian (Mahakala), Yin-Yang Dou Mu (Mother of the Dipper), Xi Shen (God of Joy), and Yu Er Shen (Yu Er God). These elements are not decorative but integral to the narrative, transforming Lovecraft’s cosmic horror into a form that resonates with Chinese readers’ cultural memories and fears.\r\n\r\nThe novel engages with philosophical themes central to both Borges and Lovecraft. The protagonist’s struggle with reality and madness echoes Borges’ \"Tlon, Uqbar, Orbis Tertius,\" where a fictional world infiltrates reality. The concept of \"Xin Su\" (Heart Essence) parallels Borges’ \"The Circular Ruins\" and Italo Calvino’s \"The Nonexistent Knight,\" questioning the nature of subjectivity and reality—if humans perceive the world through subjectivity, is subjectivity not a form of reality? The novel also explores memory distortion and alienation, as the protagonist struggles to recognize himself after transformation, echoing Lovecraft’s \"The Shadow Out of Time,\" where Peasley feels \"a strange sense of terror every time he sees his own reflection,\" and Borges’ fear of mirrors as symbols of fragmentation.\r\n\r\nThe novel’s climax embodies Lovecraftian horror: the protagonist tears off his \"Heavenly Dao\" (the cosmic order governing his existence) and devours another character, symbolizing humanity’s inability to comprehend or bear knowledge beyond cognitive limits. As in Lovecraft’s \"Through the Gates of the Silver Key\" and Borges’ \"The Book of Sand,\" ignorance is framed as a form of bliss, with the pursuit of infinite knowledge leading only to madness and destruction.\r\n\r\n### 3. Cthulhu Mythos and Western Esotericism: Italo Calvino’s \"The Castle of Crossed Destinies\" and \"Lord of the Mysteries\"\r\n\r\nAnother striking example of mythic displacement is the fusion of Cthulhu Mythos with Western esotericism in online literature, as seen in \"Lord of the Mysteries,\" which draws inspiration from Italo Calvino’s \"The Castle of Crossed Destinies\" and the tarot.\r\n\r\nThe tarot, an ancient Western divination tool popular in Europe since the Middle Ages, consists of 78 cards divided into 22 Major Arcana (Trumps) and 56 Minor Arcana. The Major Arcana are believed to predict the general course of fate, metaphorically representing the complete life journey and describing the roots and characteristics of events. Each card reflects a distinct life experience, serving as the focus of divination by providing insights into core issues and higher spiritual teachings. The Minor Arcana supplement the Major Arcana with specific hints about time, place, people, events, and objects.\r\n\r\nCalvino’s \"The Castle of Crossed Destinies\" employs a tarot deck to create a self-contained narrative system. The Major Arcana (such as \"The World,\" \"Love,\" and \"Strength\") and Minor Arcana (such as the number cards associated with \"Cups,\" \"Swords,\" \"Wands,\" and \"Pentacles\") provide a rich array of elements that can be combined to form complete stories. The tarot’s inherent ambiguity allows for multiple interpretations—whether read forward, backward, or diagonally, a coherent narrative emerges, embodying the \"crossed destinies\" of the title.\r\n\r\n\"Lord of the Mysteries\" adapts this tarot-based narrative system, merging it with Cthulhu Mythos to create a unique world of esotericism and cosmic horror. The novel features a secret organization known as the \"Tarot Club,\" whose members adopt tarot cards as codenames. Led by a god codenamed \"The Fool,\" the club is divided into holders of the Major Arcana and Minor Arcana. Excluding \"The Fool,\" there are nine Major Arcana holders—all personally selected by \"The Fool\" and each a demigod—and fewer than 23 Minor Arcana holders, who serve as subordinates to the Major Arcana. The Major Arcana regularly convene in the \"Origin Castle\" to communicate and collaborate, and after completing missions, members leave a deck of tarot cards at the scene, placing their codename card prominently. Minor Arcana holders only know their direct superior, with information about other Major Arcana holders kept confidential.\r\n\r\nThe novel also introduces \"The Blasphemy Cards,\" created by Emperor Roselle based on the second Blasphemy Slate. Comprising 22 cards (one for each Major Arcana), each contains a divine pathway and possesses anti-divination and anti-prophecy properties, making them powerful narrative devices.\r\n\r\nAt its core, \"Lord of the Mysteries\" uses the tarot as a symbol of fate—embodying both determinism and unpredictability. Beneath the tarot-based esotericism lies the Lovecraftian theme of \"otherness\": the protagonist, viewing foreign cultures from a Chinese perspective, experiences alienation and unfamiliarity, echoing the terror of encountering the unknown in Cthulhu Mythos. The novel’s steampunk aesthetic aligns with Lovecraft’s original vision, reflecting humanity’s sense of insignificance and confusion amid the Industrial Revolution—a period of rapid change that challenged traditional notions of identity and purpose.\r\n\r\n## Conclusion\r\n\r\nThis lecture traverses the intellectual landscape connecting H.P. Lovecraft’s Cthulhu Mythos to Jorge Luis Borges’ literary innovations, exploring the foundations of horror sublime aesthetics and tracing its contemporary evolution in online literature through mythic displacement. It demonstrates how Borges and Lovecraft employ motifs of darkness, immensity, and reality-fictional blurring to evoke existential awe and terror, rooted in their engagement with insomnia, blindness, and nightmares. It further illuminates Lovecraft’s influence on Borges, showcasing a synthesis of cosmic horror and literary modernism.\r\n\r\nAdditionally, the lecture examines how Cthulhu Mythos has been displaced into new cultural contexts, merging with Chinese folk customs in \"The Legend of the Strange Immortal\" and Western esotericism in \"Lord of the Mysteries.\" These works highlight the mythos’ adaptability, resonating across cultures by reflecting universal human fears of the unknown, cosmic insignificance, and the fragility of sanity.\r\n\r\nThe themes explored—fear of the unknown, the search for meaning in an indifferent universe, and the negotiation between reality and fiction—remain urgently relevant in an increasingly complex and uncertain world. This inquiry invites deeper engagement with the works of Borges, Lovecraft, and contemporary authors reimagining Cthulhu Mythos, fostering a greater appreciation for the enduring power of cosmic horror and the transformative potential of mythic displacement."
  }
]