{
  "chunpinative": {
    "title": "Initial Construction and Preliminary Properties of Chunpinative Geometry",
    "date": "2020-12-07",
    "content": "## Overview\n\nThis content takes the form of a systematic constructive record of a geometric theory, formally proposing the core axiom of \"Chunpinative Geometry\" and establishing a set of foundational concepts—including \"Chunpinative Space\" and \"Chunpinatively Measurable Space\"—on the basis of this axiom. Additionally, it deduces preliminary properties of the space and presents a key lemma proposed by a collaborator. From the perspective of mainstream geometric theory (encompassing both Euclidean and non-Euclidean geometries), the core axiom of Chunpinative Geometry—asserting that \"an angle is equivalent to its supplement\"—represents a deliberate departure from the fundamental logical relationships that govern angle arithmetic in conventional geometric systems. Specifically, it abandons the well-established rule that \"the supplement of an angle is equal to \\(180^\\circ\\) minus the measure of the original angle,\" replacing it with a direct equivalence relation. It is important to acknowledge that certain preliminary property descriptions in this initial construction lack the full rigor of formal mathematical derivation, as they serve as tentative deductions to frame the theory’s structure. As indicated by contextual cues embedded in the naming and framing, this work is a playful, commemorative simulation of a mathematical theory: it adopts the rigorous framework of axiom-based geometric system construction to pay lighthearted tribute to the author’s junior high school mathematics teacher, Chunping Ding (with the term \"Chunpinative\" derived from the teacher’s given name \"Chunping\"), and to classmate CZL, who contributed the key lemma to the theory.\n\n---\n\n## 1. Core Axiom and Basic Definitions of Chunpinative Geometry\n\n### 1.1 Foundational Axiom: The Dual-Complementary Principle (D-C-P Axiom)\n\nThe core axiom of Chunpinative Geometry, formally designated the Dual-Complementary Principle (abbreviated as the D-C-P Axiom), is explicitly and rigorously stated as follows: **An angle is axiomatically equivalent to its supplement**. Within the theoretical context of this axiom, the term \"angle\" is defined as the geometric figure formed by two non-coincident, intersecting line segments or rays in a given geometric space—consistent with the standard definition of an angle in elementary geometric theory, but constrained to the specific axiomatic framework of Chunpinative Geometry. The \"supplement\" (or \"supplementary angle\") retains its conventional geometric meaning: an angle whose measure, when added to the measure of the original angle, equals \\(180^\\circ\\) (or \\(\\pi\\) radians, when using the radian system of angle measurement). This axiom constitutes a deliberate break from the traditional geometric constraint that \"the supplement of an angle is arithmetically equal to \\(180^\\circ\\) minus the measure of the original angle\"; instead, it establishes a direct, unmediated equivalence between an angle and its supplement. As the foundational axiom of the entire theory, it serves as the logical starting point for constructing all subsequent definitions, properties, and lemmas within Chunpinative Geometry.\n\n### 1.2 Definition of the Core Geometric Space: Chunpinative Space\n\n**1.2.1 Formal Definition**: A geometric space is formally defined as a **Chunpinative Space** if and only if it satisfies the D-C-P Axiom—i.e., in every region and for every possible configuration of intersecting line segments or rays within the space, the angle formed is equivalent to its supplement. The broader theoretical system that investigates the structural characteristics, algebraic properties, and measurement of general sets within such spaces is collectively termed **Chunpinative Geometry**. The naming convention for both the space and the geometric theory is dual-purpose: it emphasizes the centrality of the D-C-P Axiom to the entire framework, while also carrying contextual commemorative significance tied to the individuals honored by the theory.\n\n**1.2.2 Scope of Application and Future Extensions**: The initial definition of Chunpinative Space presented herein is formulated within a general, unrestricted geometric framework, designed to apply to the most common cases of two-dimensional and three-dimensional spaces. However, special cases of geometric spaces—including zero-dimensional spaces (isolated points), one-dimensional spaces (lines or curves), and discrete spaces (countable sets of non-continuous points)—introduce unique constraints that are not fully addressed in this preliminary construction. These special cases will require additional axiomatic supplements, restrictive conditions, and tailored definitions in subsequent extensions of the theory, which will be the focus of detailed follow-up research aimed at generalizing Chunpinative Geometry to a more comprehensive set of geometric contexts.\n\n### 1.3 Preliminary Properties of Chunpinative Spaces\n\nBy applying the D-C-P Axiom to the formal definition of Chunpinative Space, the following three preliminary properties can be deduced. These properties are not exhaustive but serve as foundational building blocks for further investigations into the structural and algebraic characteristics of Chunpinative Spaces:\n\n- **Property i (Space Carrier and Coordinate Representation)**: A general Chunpinative Space is defined over the Cartesian product \\(X \\times Y\\), where \\(X\\) and \\(Y\\) are non-empty sets. In line with conventional geometric practice, \\(X\\) and \\(Y\\) are typically number sets (such as the set of real numbers \\(\\mathbb{R}\\), the set of integers \\(\\mathbb{Z}\\), or other ordered number fields) or point sets in traditional Euclidean space. This Cartesian product structure implies that every element (referred to as a \"point\") within the Chunpinative Space can be uniquely represented by an ordered pair \\((x, y)\\) where \\(x \\in X\\) and \\(y \\in Y\\). This coordinate representation provides a critical foundation for analytical studies of the space, enabling the use of algebraic tools to investigate geometric relationships within Chunpinative Geometry. The specific forms of \\(X\\) and \\(Y\\) (e.g., whether they are continuous or discrete, finite or infinite) are not fixed universally but are determined by the specific research objectives and contextual constraints of the Chunpinative Space under investigation.\n\n- **Property ii (Algebraic Structure: Commutativity and Non-Closure Under Addition)**: All Chunpinative Spaces exhibit the structure of an Abelian (commutative) space with respect to the standard binary operation of vector or point addition. Formally, this means that for any two elements \\(a\\) and \\(b\\) within a Chunpinative Space \\(\\mathcal{C}\\), the commutative law holds: \\(a + b = b + a\\). This property aligns with the algebraic structure of many conventional geometric spaces (such as Euclidean space) and ensures consistency with basic algebraic operations. However, a distinguishing feature of Chunpinative Spaces is their non-closure under addition: unlike Euclidean space, where the sum of two vectors (or points) remains within the space, the result of adding two elements in a Chunpinative Space may not belong to the space itself. A rigorous proof of this non-closure property is reserved as an exercise for further exploration; the core strategy for such a proof involves constructing explicit counterexamples that leverage the D-C-P Axiom to demonstrate cases where the sum of two elements violates the axiomatic constraints of Chunpinative Space.\n\n- **Property iii (Rigidity and Structural Invariance)**: Every Chunpinative Space is inherently rigid, a property primarily manifested in its resistance to deformation. In traditional geometric terminology, \"rigidity\" refers to the property of a geometric figure or space wherein the distances between points (and thus the shape and size of the figure) remain unchanged when subjected to external forces or transformations that do not involve stretching or compression. In the context of Chunpinative Spaces, this rigidity is a direct consequence of the uniqueness of angle relationships imposed by the D-C-P Axiom: since an angle is equivalent to its supplement, the measure of any angle in the space is uniquely determined (for real-valued angle measures, this unique value is \\(90^\\circ\\), as \\(x = 180^\\circ - x\\) implies \\(x = 90^\\circ\\)). This unique angle constraint fixes the relative positional relationships between line segments, rays, and planes within the space, preventing arbitrary deformation or reconfiguration without violating the D-C-P Axiom. Verification of this rigidity property can be concretely achieved by constructing a specific instance of a Chunpinative Space (such as the specialized space referenced in Lemma 1.3) and analyzing its structural invariance under standard geometric transformations (e.g., translations, rotations, or shears).\n\n### 1.4 Key Lemma: The CZL Lemma\n\n**Lemma Statement (1.3 Lemma)**: There exists at least one Chunpinative Space in which a right triangle with a vertex angle of \\(100^\\circ\\) can be embedded. This lemma is proposed by classmate CZL and is formally designated the CZL Lemma in recognition of this contribution. The CZL Lemma represents a critical breakthrough in the study of the specific structural characteristics of Chunpinative Spaces, as it confirms the existence of specialized Chunpinative Spaces that diverge significantly from both Euclidean and non-Euclidean spaces—wherein a right triangle (defined as a triangle containing a \\(90^\\circ\\) angle) cannot have a vertex angle of \\(100^\\circ\\) due to the constraints of the triangle angle sum theorem.\n\n**Relationship to General Chunpinative Spaces**: The specialized Chunpinative Space described in the CZL Lemma is explicitly a special case of the general Chunpinative Space defined in Property i (1.2.1 i). While the general Chunpinative Space is defined over the unrestricted Cartesian product \\(X \\times Y\\), the space in the CZL Lemma corresponds to a specific realization of \\(X \\times Y\\) with constrained forms of \\(X\\) and \\(Y\\) (e.g., non-standard number sets or modified coordinate systems). This specialized space thus embodies the general structure of Chunpinative Spaces under particular contextual conditions, demonstrating the flexibility and diversity of the theory’s framework.\n\n### 1.5 Construction Method of Specialized Chunpinative Spaces\n\nThe construction of the specialized Chunpinative Space that satisfies the CZL Lemma—i.e., a space in which a right triangle with a \\(100^\\circ\\) vertex angle can exist—requires the application of the mathematical technique of global analytic continuation. Analytic continuation is a well-established method in mathematical analysis, typically used to extend the domain of a function beyond its original definition while preserving key analytical properties (such as holomorphy or continuity). In the context of Chunpinative Space construction, this technique is adapted to transcend the constraints of the traditional Cartesian product \\(X \\times Y\\), enabling the expansion and modification of the space’s structure to accommodate the unique geometric configuration specified by the CZL Lemma.\n\nFormally, the process of global analytic continuation transforms the original general Chunpinative Space (defined over \\(X \\times Y\\)) into a mapping from \\(X \\times Y\\) to \\(\\xi(X \\times Y)\\), where \\(\\xi(X \\times Y)\\) (abbreviated as \\(\\xi\\) for brevity when no ambiguity arises) denotes the extended, specialized Chunpinative Space post-continuation. The core of this mapping lies in the redefinition of angle measurement rules within the space: while the D-C-P Axiom is retained as the foundational constraint, the method of assigning numerical measures to angles is modified to allow for the coexistence of a right angle (consistent with the D-C-P Axiom) and a \\(100^\\circ\\) vertex angle in the same triangle. This modification breaks the traditional triangle angle sum theorem (which requires the sum of angles in a triangle to be \\(180^\\circ\\) in Euclidean space), thereby enabling the existence of the specialized right triangle specified by the CZL Lemma.\n\n### 1.6 Definition of Chunpinatively Measurable Spaces\n\n**Formal Definition (1.4 Definition)**: Let \\(\\xi\\) be a non-empty Chunpinative Space obtained via the method of global analytic continuation (i.e., \\(\\xi \\neq \\emptyset\\)), and let \\(R\\) be a \\(\\sigma\\)-algebra consisting of subsets of \\(\\xi\\). The ordered pair \\((\\xi, R)\\) is formally defined as a **Chunpinatively Measurable Space**. The \\(\\sigma\\)-algebra \\(R\\) must satisfy the three standard axioms of \\(\\sigma\\)-algebras in measure theory: 1. The entire specialized Chunpinative Space \\(\\xi\\) is an element of \\(R\\) (i.e., \\(\\xi \\in R\\)); 2. The \\(\\sigma\\)-algebra is closed under complementation: if a subset \\(A\\) of \\(\\xi\\) is an element of \\(R\\) (i.e., \\(A \\in R\\)), then the complement of \\(A\\) with respect to \\(\\xi\\) (denoted \\(\\xi \\setminus A\\)) is also an element of \\(R\\); 3. The \\(\\sigma\\)-algebra is closed under countable unions: for any countable sequence of subsets \\(A_1, A_2, \\dots, A_n, \\dots\\) where each \\(A_k \\in R\\) (for \\(k = 1, 2, 3, \\dots\\)), their union \\(\\bigcup_{k=1}^\\infty A_k\\) is also an element of \\(R\\). This definition of the \\(\\sigma\\)-algebra provides a rigorous mathematical foundation for the subsequent definition of measures on Chunpinative Spaces, serving as an essential prerequisite for the study of the measurement of general sets (such as line segments, regions, or surfaces) within the framework of Chunpinative Geometry.\n\n## 2. Supplementary Notes on Chunpinative Geometry\n\nIt is important to explicitly note that the content presented herein constitutes an initial, preliminary attempt to construct the theoretical framework of Chunpinative Geometry. As such, it may contain limitations and areas for improvement, including (but not limited to) incomplete logical derivations for certain preliminary properties, potential imprecisions in the formalization of edge-case concepts, and the absence of comprehensive proofs for all assertions. The core purpose of this initial construction is not to present a fully mature, peer-reviewed mathematical theory, but rather to convey creative ideas through a playful, commemorative adaptation of the rigorous framework of axiom-based geometric system construction. A revised, expanded, and fully self-consistent version of Chunpinative Geometry has since been refined and systematically organized in January,2025. This improved version enhances the theoretical rigor, logical consistency, and comprehensiveness of the entire system, and is accessible via the following link: [https://www.runnelzhang.com/achieved/paper-cpg](https://www.runnelzhang.com/achieved/paper-cpg)."
  },
  "graph-alg": {
    "title": "Prop Presentations for Linear Algebra: The $\\mathbf{cb}_k$ Calculus",
    "date": "2021-06-21",
    "content": "## Overview\r\nI have finally traced the definitive origin of this elegant piece of graphical mathematics by Dr. Peng! The fragment I was studying belongs to the seminal work **\"Graphical Linear Algebra\"** (specifically, see **arXiv:2105.06244**). This paper provides the rigorous categorical \"source code\" for representing linear algebra not through grids of numbers, but through the topology of string diagrams.\r\n\r\nThe specific formalism identified is the theory $\\mathbf{cb}_k$ (standing for *commutative bialgebra* with *scalars* over a ring $k$). The central result is breathtaking in its simplicity and power: this diagrammatic language is a complete presentation for the prop $\\mathbf{Mat}_k$. In other words, **diagrams are matrices**, and topological manipulation is linear algebra.\r\n\r\nFor those interested in a more pedagogical entry point, the authors maintain an incredible resource at **[graphicallinearalgebra.net](https://graphicallinearalgebra.net/)**, which unfolds this theory as a narrative about the interaction between two fundamental operations: Copying and Adding. Below is a detailed academic note synthesizing the formal definition from the paper with the intuitive insights from the website.\r\n\r\n![DEMO](fragments/graph-alg/demo.jpeg)\r\n\r\n***\r\n\r\n## Academic Note: The Prop $\\mathbf{cb}_k$ and Diagrammatic Reasoning\r\n\r\n### 1. Introduction to the Formalism\r\nThe core idea is to define a **Prop** (Product and Permutation category)—a symmetric monoidal category where objects are natural numbers representing wire counts ($n, m, \\dots$) and morphisms are diagrams mapping $n$ inputs to $m$ outputs.\r\n\r\nThe specific prop defined in the literature is $\\mathbf{cb}_k$. It models the behavior of matrices over a ring $k$ equipped with the direct sum operation.\r\n\r\n### 2. Generators: The Alphabet of Linear Algebra\r\nAccording to **Definition 1.1** (based on [34, Defn 3.4] in the source), the language is built from three distinct classes of generators.\r\n\r\n*(Note: In the diagrams below, time flows from bottom to top. Inputs are at the bottom, outputs are at the top.)*\r\n\r\n**A. The Copying Structure (The \"White\" Comonoid)**\r\nThese generators form a commutative comonoid structure.\r\n*   **The Copier ($\\Delta$):** A white node splitting 1 wire into 2.\r\n    $$\r\n    \\begin{matrix}\r\n    \\mid & \\mid \\\\\r\n    \\nwarrow & \\nearrow \\\\\r\n       & \\circ & \\\\\r\n       & \\mid &\r\n    \\end{matrix}\r\n    $$\r\n    *   *Semantics:* This represents the linear map $V \\to V \\oplus V$ given by $v \\mapsto (v, v)$. In the blog's terminology, this is the \"Crema\"—the ability to clone data.\r\n\r\n*   **The Discarder/Counit ($\\epsilon$):** A white node terminating a wire.\r\n    $$\r\n    \\begin{matrix}\r\n       \\circ \\\\\r\n       \\mid\r\n    \\end{matrix}\r\n    $$\r\n    *   *Semantics:* This is the map $V \\to \\{0\\}$, effectively \"deleting\" a variable.\r\n\r\n**B. The Adding Structure (The \"Grey\" Monoid)**\r\nThese generators form a commutative monoid structure.\r\n*   **The Adder ($\\mu$):** A grey (shaded) node merging 2 wires into 1.\r\n    $$\r\n    \\begin{matrix}\r\n       & \\mid & \\\\\r\n       & \\bullet & \\\\\r\n    \\nearrow & & \\nwarrow \\\\\r\n    \\mid & & \\mid\r\n    \\end{matrix}\r\n    $$\r\n    *   *Semantics:* This represents the linear map $V \\oplus V \\to V$ given by $(u, v) \\mapsto u + v$. The blog refers to this as \"Zucchero\"—combining resources.\r\n\r\n*   **The Zero/Unit ($\\eta$):** A grey node starting a wire from nothing.\r\n    $$\r\n    \\begin{matrix}\r\n       \\mid \\\\\r\n       \\bullet\r\n    \\end{matrix}\r\n    $$\r\n    *   *Semantics:* This injects the additive identity (0) into the wire ($k \\to V$).\r\n\r\n**C. The Scalar Structure**\r\n*   **Scalar Multiplication:** A box or bead labeled with $a \\in k$.\r\n    $$\r\n    \\begin{matrix}\r\n       \\mid \\\\\r\n       \\boxed{a} \\\\\r\n       \\mid\r\n    \\end{matrix}\r\n    $$\r\n    *   *Semantics:* Represents the map $v \\mapsto a \\cdot v$.\r\n\r\n---\r\n\r\n### 3. The Equational Theory (Relations)\r\nThe power of $\\mathbf{cb}_k$ comes from the rules governing how these nodes interact. The system is defined modulo the equations of a **Bicommutative Bialgebra**.\r\n\r\n**I. Monoid and Comonoid Laws**\r\n*   **Associativity (Grey):** Connecting two Adders in sequence is equivalent regardless of grouping.\r\n    $$\r\n    \\begin{matrix}\r\n    \\mid \\\\ \\bullet \\\\ \\nearrow \\ \\nwarrow \\\\ \\mid \\quad \\ \\bullet \\\\ \\quad \\ \\nearrow \\ \\nwarrow\r\n    \\end{matrix}\r\n    \\quad = \\quad\r\n    \\begin{matrix}\r\n    \\mid \\\\ \\bullet \\\\ \\nearrow \\ \\nwarrow \\\\ \\bullet \\quad \\ \\mid \\\\ \\nearrow \\ \\nwarrow \\quad\r\n    \\end{matrix}\r\n    $$\r\n*   **Co-associativity (White):** The same law applies to the Copying structure (upside down).\r\n*   **Commutativity:** The Adder and Copier are symmetric; swapping input/output wires changes nothing.\r\n\r\n**II. The Bialgebra Law**\r\nThis is the most critical equation in the entire system. It defines how Addition and Copying interact. It asserts that **copying the result of an addition** is the same as **adding the results of copies**.\r\n\r\n$$\r\n\\text{Diagrammatically:}\r\n$$\r\n$$\r\n\\begin{matrix}\r\n  \\mid & & \\mid \\\\\r\n  \\nwarrow & & \\nearrow \\\\\r\n   & \\circ & \\\\\r\n   & \\mid & \\\\\r\n   & \\bullet & \\\\\r\n  \\nearrow & & \\nwarrow \\\\\r\n  \\mid & & \\mid\r\n\\end{matrix}\r\n\\quad = \\quad\r\n\\begin{matrix}\r\n   & \\mid & & \\mid & \\\\\r\n   & \\bullet & & \\bullet & \\\\\r\n   \\nearrow & & \\times & & \\nwarrow \\\\\r\n   & \\circ & & \\circ & \\\\\r\n   & \\mid & & \\mid &\r\n\\end{matrix}\r\n$$\r\n\r\n*   **Left Hand Side:** Add two inputs ($\\bullet$), then Copy the result ($\\circ$).\r\n*   **Right Hand Side:** Copy both inputs first ($\\circ \\circ$), swap the inner wires ($\\times$), and Add them separately ($\\bullet \\bullet$).\r\n\r\nAlgebraically, this enforces the distributive law:\r\n$$ \\Delta(x + y) = \\Delta(x) + \\Delta(y) $$\r\n\r\n**III. Scalar Relations**\r\nThe \"Additional Equations\" ensure the scalars behave as a Ring:\r\n*   **Multiplication:** Composing box $a$ and box $b$ equals box $ab$.\r\n    $$\r\n    \\begin{matrix} \\boxed{b} \\\\ \\mid \\\\ \\boxed{a} \\end{matrix} \\quad = \\quad \\begin{matrix} \\boxed{ab} \\end{matrix}\r\n    $$\r\n*   **Additivity:** Parallel scalars summed together equal the scalar of the sum.\r\n    $$\r\n    \\begin{matrix}\r\n    \\mid \\\\ \\bullet \\\\ \\nearrow \\ \\nwarrow \\\\ \\boxed{a} \\quad \\boxed{b} \\\\ \\nwarrow \\ \\nearrow \\\\ \\circ \\\\ \\mid\r\n    \\end{matrix}\r\n    \\quad = \\quad\r\n    \\begin{matrix}\r\n    \\mid \\\\ \\boxed{a+b} \\\\ \\mid\r\n    \\end{matrix}\r\n    $$\r\n*   **Identity:** A scalar box of $1$ is just a wire. A scalar box of $0$ is equivalent to Discarding then creating a Zero unit ($\\epsilon$ followed by $\\eta$).\r\n\r\n---\r\n\r\n### 4. The Main Result: Completeness\r\n**Proposition 1.2 [34, Prop. 3.9] states:**\r\n> Given a ring $k$, $\\mathbf{cb}_k$ is a presentation for the prop $\\mathbf{Mat}_k$ of matrices over $k$ under the direct sum.\r\n\r\n**Interpretation:**\r\nThis is a **Soundness and Completeness** theorem.\r\n1.  **Soundness:** Every equation derivable in diagrams is a true statement about matrices.\r\n2.  **Completeness:** *Every* true statement about matrices can be proven using these diagrams.\r\n\r\nThere is an isomorphism of categories:\r\n$$ \\mathbf{cb}_k \\cong \\mathbf{Mat}_k $$\r\nThis transforms linear algebra from a theory of coordinates to a theory of **connectivity**.\r\n\r\n---\r\n\r\n## Commentary: Methodology and Applications\r\n\r\n### Why Graphical Linear Algebra?\r\nThe transition from classical matrix notation ($A_{ij}$) to the $\\mathbf{cb}_k$ calculus is analogous to the shift from assembly language to a high-level programming language.\r\n\r\n1.  **Basis Independence:**\r\n    Classical linear algebra forces us to choose a basis immediately to write down a matrix. In $\\mathbf{cb}_k$, we manipulate the linear maps directly via their structural properties (Copy/Add). We only \"compile\" to a matrix when absolutely necessary.\r\n\r\n2.  **Topological Insight:**\r\n    Many properties of linear maps (like the trace, transpose, or feedback) are topological.\r\n    *   **Transpose:** Corresponds to rotating the diagram 180 degrees.\r\n    *   **Trace:** Corresponds to connecting an output wire back to an input wire (a loop).\r\n    *   Standard algebraic proofs involving indices ($\\sum_k A_{ik}B_{kj}$) are notoriously error-prone. The diagrammatic proof is often a visual tautology—you simply \"pull the wires straight.\"\r\n\r\n3.  **Connection to Quantum Mechanics (ZX-Calculus):**\r\n    The structure of $\\mathbf{cb}_k$ is strikingly similar to the **ZX-calculus** used in quantum computing. In ZX, we also have two colors (Green and Red spiders) that satisfy a bialgebra law.\r\n    *   In Linear Algebra ($\\mathbf{cb}_k$): The structures are \"Copy\" ($\\circ$) and \"Add\" ($\\bullet$).\r\n    *   In Quantum (ZX): The structures correspond to complementary observables (Z and X bases).\r\n    Mastering $\\mathbf{cb}_k$ is an excellent prerequisite for understanding categorical quantum mechanics.\r\n\r\n### Applicability\r\nThis method is most effective when:\r\n*   **Analyzing Large Networks:** Signal flow graphs and electrical circuits are naturally modeled by these diagrams.\r\n*   **Proving Structural Identities:** When proving identities that hold for *any* dimension $n$, diagrams are superior to matrices, which often require fixing $n$.\r\n*   **Tensor Networks:** In machine learning and physics, the management of indices in tensor contractions is painful. Diagrammatic notation handles these contractions implicitly via wire connectivity.\r\n\r\n## References\r\n*   **Primary Paper:** *Graphical Linear Algebra*, arXiv:2105.06244.\r\n*   **Original Definitions:** Bonchi, Sobociński, Zanasi, *Interacting Hopf Algebras*, J. Pure Appl. Algebra (2014).\r\n*   **Web Resource:** [Graphical Linear Algebra](https://graphicallinearalgebra.net/) - A pedagogical blog by Pawel Sobocinski."
  },
  "hdc-email": {
    "title": "Follow-up on Hugo Duminil-Copin's Lecture: Probing SAW Universality and 4D Triviality",
    "date": "2025-11-27",
    "content": "## Overview\r\n\r\nFollowing the suggestion from Professor Hugo Duminil-Copin, I sent a detailed email to him to follow up on the questions I was unable to ask during the Q&A session. The email, sent on November 27, 2025, covers two major topics: the subtle mathematical reasons behind the solvability of **Self-Avoiding Walks (SAW)** on the honeycomb lattice versus the square lattice (the **Symmetry-Complexity Paradox**), and a more conceptual inquiry into his work on the **Marginal Triviality of the 4D $\\Phi^4$ model** in Quantum Field Theory. Since the email has not been answered, I plan to resolve these questions through self-study, and the formatted email below serves as the structured outline for that research.\r\n\r\n***\r\n\r\n## Detailed Summary of the Follow-Up Email\r\n\r\nThe email is structured into an introduction and two major sections, each containing a set of focused questions.\r\n\r\n### 1. Introduction and Context\r\n\r\nI identified myself as the undergraduate student from Nanjing University (NJU) who specifically traveled to Southeast University (SEU) for the talk and was the first to ask for a joint photograph. The purpose of the email was to convey my enthusiasm and follow up on the promised questions due to Professor Duminil-Copin's tight schedule.\r\n\r\n### 2. Part I: SAW Universality and Lattice Geometry\r\n\r\nThis section dives deep into the **Self-Avoiding Walk (SAW)** problem, focusing on the contrast between the solvable honeycomb lattice and the unsolved square lattice.\r\n\r\n*   **Core Fascination:** The \"analogy\" thinking that led to the solution via the **parafermionic operator** was highlighted as the central point of interest.\r\n*   **The Debate:** I presented a summary of a debate with a roommate (Yuyang Su) regarding the underlying reason for the honeycomb lattice's solvability.\r\n    *   *Opposing Argument:* The roommate suggested solvability is merely due to the **lower coordination number** (3 choices on honeycomb versus 4 on square).\r\n    *   *My Counter-Argument (Hypothesis):* I argued that this simplistic view violates the **Universality Principle** of statistical mechanics and that historical examples (like the solvable Ising model on the square lattice) contradict the idea that local degrees of freedom are the primary barrier. I hypothesized that the solution hinges on a specific, non-obvious **algebraic cancellation** allowed by the honeycomb's geometry but absent in the square lattice.\r\n\r\n*   **The Questions:**\r\n    1.  **Symmetry-Complexity Paradox:** Why does the superior four-fold rotational symmetry of the square lattice appear to *complicate* the analysis, while the less symmetric honeycomb lattice permits a closed-form solution? Is there a deeper mathematical principle governing this inverse relationship?\r\n    2.  **Methodological Extension:** Since the current method does not apply to the square lattice, could a modified approach involving **parafermionic operators**, perhaps integrated with additional symmetries or disorder operators, be the key to future progress?\r\n\r\n### 3. Part II: 4D Triviality and Scaling Limits\r\n\r\nThe second part transitions to Professor Duminil-Copin's work on fundamental physics, specifically the paper *Aizenman, Duminil-Copin, Marginal triviality of the scaling limits of critical 4D Ising and $\\phi^4$ models*, which was recommended by members of the Chinese academic forum \"Chaoli.\" I noted the connection to a forum member, Chengyang Shao, a postdoc at HDC's home institution, IHÉS.\r\n\r\n*   **The Concept:** The focus is on **marginal triviality**—the finding that the 4D $\\Phi^4$ model behaves like a Gaussian (free) field in the scaling limit.\r\n\r\n*   **The Questions:**\r\n    1.  **Geometric Intuition:** From an intuitive or geometric standpoint (e.g., in the language of **random currents** or polymers), what specific feature in four dimensions causes the non-Gaussian interactions to effectively vanish, making 4D intersections appear **\"transparent\"** in the limit?\r\n    2.  **SAW Connection:** Given that the **upper critical dimension for SAW is 4**, does the $\\Phi^4$ model's triviality imply that the \"self-avoiding\" constraint becomes geometrically negligible in 4D, making the polymer path behave essentially like a simple **random walk**?\r\n    3.  **Dynamical Perspective (Critical Regularity Structures):** A question posed by a forum member (Hachiri Tomoko) on the dynamic $\\Phi^4$ equation: Considering the static triviality and the success of Martin Hairer’s **Regularity Structures** theory in sub-critical cases (like $\\Phi^4_3$), is there a **\"critical version\" of regularity structures** (or an equivalent tool) that can rigorously describe the 4D dynamic $\\Phi^4$ equation?\r\n\r\n### 4. Conclusion\r\n\r\nThe email concluded with a polite acknowledgment of the volume of questions, stating that a brief comment or pointer to relevant literature would be sufficient, and reiterating my sincere enthusiasm.\r\n\r\n***\r\n\r\n## The Follow-up Email: Research Outline\r\n\r\nSince the email has not yet been answered, it will now serve as my personal research outline for investigating these advanced topics.\r\n\r\n> Subject: **Follow-up on your lecture at SEU: SAW Universality & 4D Triviality (Student from NJU)**\r\n> \r\n> From: Runnel Zhang <runnel.zhang@smail.nju.edu.cn>\r\n> \r\n> Date: Thursday, November 27, 2025, 10:08 PM\r\n> \r\n> To: Hugo Duminil-Copin <hugo.duminil@unige.ch>\r\n> \r\n> Dear Professor Duminil-Copin,\r\n> \r\n> I hope this email finds you well.\r\n> \r\n> I am the undergraduate student from Nanjing University who attended your lecture at Southeast University on November 26th. I traveled from NJU specifically to hear your talk, and I was the one who rushed to the stage first to ask for a photo with you. It was truly an inspiring experience for me.\r\n> \r\n> At that time, I had a few questions, but due to your tight schedule, you kindly suggested that I reach out via email. I am writing to follow up on that conversation.\r\n> \r\n> My first set of questions concerns the honeycomb lattice **Self-Avoiding Walks (SAW)** part of your talk. It is such a legendary work, and I was fascinated by the \"**analogy**\" thinking using the **parafermionic operator**. While my background is not yet deep enough to fully grasp the rigorous proof, I had an interesting debate with my roommate regarding the intuition behind it.\r\n> \r\n> My roommate Yuyang Su argued that the complexity of the SAW problem is primarily determined by the coordination number (the number of available directions at a vertex)—that the honeycomb lattice is solvable simply because a walker only has 3 choices, whereas other lattices have more. I respectfully disagreed with him. I argued that in statistical mechanics, difficulty rarely scales linearly with the number of local degrees of freedom. If it were just about counting paths, the principle of **Universality** would be compromised. I pointed out that historically, some integrable models (like the Ising model) were solved on square lattices despite having a higher coordination number, implying that \"having more directions\" is not the fundamental barrier. I suspect the honeycomb lattice succeeds because its geometry allows for a specific **algebraic cancellation** that the square lattice forbids—but I couldn't explain to him why the square lattice, with its superior symmetry, fails to support this structure.\r\n> \r\n> Driven by this discussion, I have formulated the following questions:\r\n> \r\n> 1. The square lattice possesses a higher four-fold rotational **symmetry** compared to the honeycomb lattice, which intuitively should simplify the problem. Yet in reality, this seems to make it more challenging. Is there a deeper mathematical principle explaining why **increased symmetry can sometimes complicate rather than simplify the analysis**?\r\n> 2. As you noted, the method does not apply directly to the square lattice, where the connective constant is still unknown. Do you think modified versions of the **parafermionic approach**—perhaps incorporating additional symmetries or **disorder operators**—could eventually yield progress there?\r\n> \r\n> The second part of my email relates to your other work. I am the youngest core member of a small academic forum here in China called \"**Chaoli**\". After sharing my excitement about your lecture, our members recommended that I read your work on 4D physics: *Aizenman M., Duminil-Copin H., Marginal triviality of the scaling limits of critical 4D Ising and $\\phi^4$ models.*\r\n> \r\n> Interestingly, the introductory article on our forum regarding this paper (https://chaoli.club/index.php/6841/) was authored by Chengyang Shao, who I believe is currently a postdoc at **IHÉS**, your home institution!\r\n> \r\n> Since my background in quantum field theory is still developing, I have a more intuitive question regarding this work:\r\n> \r\n> 1. The result establishes the \"**marginal triviality**\" (**Gaussian behavior**) in 4D. Intuitively, what specific geometric feature of the \"**random currents**\" or polymer representation in 4D causes the non-Gaussian interactions to vanish? Is there a visual way to understand why **4D intersections become \"transparent\"** in the scaling limit compared to 3D?\r\n> 2. This brings me back to your lecture on SAW. In 2D, the self-avoiding constraint fundamentally changes the universality class. However, since the **upper critical dimension for SAW is 4**, does this mean that in 4D, the \"**self-avoiding**\" constraint becomes geometrically negligible? Is the triviality of the **$\\phi^4$ field** essentially stating that the polymer representation behaves like a simple **random walk** because the paths rarely intersect in such high dimensions?\r\n> 3. One of our members nicknamed Hachiri Tomoko raised a question regarding the dynamical perspective. Since the static $\\phi^4_4$ is trivial, how should we understand this via **Stochastic Quantization**? Martin Hairer’s **Regularity Structure theory** has successfully handled the sub-critical cases (like $\\Phi^4_3$).\r\n> **The Question: Is there a \"critical version\" of regularity structures (or similar tools) that can rigorously describe the 4D dynamic $\\phi^4$ equation?** (This might be slightly tangential... I'm just the *porteur* of this question)\r\n> \r\n> Thank you so much for your time.\r\n> \r\n> I realize this email contains quite a few questions. Please do not feel pressured to answer them in detail. If you are busy, a brief comment or a pointer to relevant reading references would already be incredibly helpful. I do not wish to disturb your busy schedule but simply wanted to convey my enthusiasm.\r\n> \r\n> Sincerely yours,\r\n> \r\n> **Runnel Zhang** | Undergraduate Student\r\n> Nanjing University | Jianxiong Academy\r\n> 22 Hankou Road, Gulou District, Nanjing 210093, China\r\n> Phone: +86 198 5277 1690\r\n> runnel.zhang@smail.nju.edu.cn | nju.edu.cn"
  },
  "hdc-lecture": {
    "title": "A Successful Star-Chase: Cutting Class for Hugo Duminil-Copin's Lecture on Self-Avoiding Walks",
    "date": "2025-11-26",
    "content": "## Overview\r\n\r\nI cut class to attend a lecture by Fields Medalist Hugo Duminil-Copin and was the first to rush forward for a photo afterward—a completely successful fan moment! Initially, I thought I would not understand anything and was just going to observe, but Hugo's presentation was surprisingly accessible, which is also closely related to his choice of topic.\r\n\r\n![PHOTO WITH HDC](/fragments/hdc-lecture/default.jpeg)\r\n\r\n***\r\n\r\n## Detailed Summary of the Lecture Content\r\n\r\nThe lecture, while initially confusing to me, proved to be an illuminating exploration of combinatorial probability and statistical mechanics, primarily focusing on **Self-Avoiding Walks (SAW)**, not the more general concept of a random walk.\r\n\r\n### 1. Structure and Initial Analogy\r\n\r\nThe beginning of the talk was framed using an accessible analogy, which I initially summarized as:\r\n\r\n> \"The presentation was structured a bit like teaching sequences to high school students, where you look for a pattern step by step, and then are told the pattern you found is wrong, which served as an introduction to the difficulties of the random walk.\"\r\n\r\nThis method served to illustrate the inherent challenges and non-obvious nature of finding closed-form solutions in probability theory, especially concerning the intricacies of walks on lattices.\r\n\r\n### 2. The Focus: Self-Avoiding Walks (SAW)\r\n\r\nWhile I first mistook the subject for general random walks, the core of the discussion was the **Self-Avoiding Walk (SAW)**, a critical model in statistical mechanics for polymer chains.\r\n\r\n| Concept | Explanation |\r\n| :--- | :--- |\r\n| **Self-Avoiding Walk (SAW)** | A sequence of moves on a lattice that does not visit the same site more than once. It is a fundamental model for the shape of a long-chain polymer in a solvent. |\r\n| **Random Walk** | A mathematical formalization of a path that consists of a succession of random steps, typically allowing repetition of sites. |\r\n\r\n### 3. Key Concepts and Results Discussed\r\n\r\nHDC moved from general concepts to specific, groundbreaking results, highlighting the influence of geometry and symmetry on problem solvability.\r\n\r\n#### The Space-Filling Property\r\n\r\nIn the earlier part of the lecture, HDC emphasized a crucial property of SAW: **Space-Filling**.\r\n\r\n*   **Concept:** He discussed how, under certain conditions, supercritical self-avoiding walks are space-filling. This property is foundational to understanding the macroscopic behavior of the walks.\r\n*   **Reference:** This topic relates to his work: *H. Duminil-Copin, G. Kozma, and A. Yadin, “Supercritical self-avoiding walks are space-filling,” Probability Theory and Related Fields, 2014.* (arXiv:1110.3074) \r\n\r\n#### The Honeycomb Lattice Result\r\n\r\nThe central focus of his talk, and perhaps the main 'hook' for the audience, was the analytical solution for the **connective constant** of the honeycomb lattice.\r\n\r\n*   **Progression:** The lecture progressed from analyzing the random walk on a square lattice to the SAW on a honeycomb (hexagonal) lattice.\r\n*   **Groundbreaking Result:** HDC spoke at length about his result for the honeycomb lattice, which is currently \"the only determined exact analytic expression for a 2D case.\"\r\n*   **Connective Constant:** This is the exponential growth rate of the number of SAWs of length *n* on a given lattice.\r\n*   **Reference:** This result was published in a top-tier journal, reflecting the significance of the work: *H. Duminil-Copin and S. Smirnov, “The connective constant of the honeycomb lattice equals $\\sqrt{2 + \\sqrt{2}}$,” Annals of Mathematics, 2012.* (arXiv:1007.0575) \r\n*   **Confidence:** The fact that he presented an *Annals of Mathematics* result simply as an attention-grabbing \"hook\" demonstrates the confidence one would expect from a Fields Medalist.\r\n\r\n#### The Role of Geometry and Symmetry\r\n\r\nHDC then addressed the difficulty of the square lattice problem, explaining \"why his method is not viable for the random walk on the square lattice,\" referencing the \"influence of symmetry and other properties.\"\r\n\r\n### 4. The Methodological Takeaway\r\n\r\nThe concluding part of the lecture shifted away from \"hardcore content\" and focused on broader mathematical philosophy.\r\n\r\n> \"Behind this, there wasn't much hardcore content, just discussions about problem-solving mindsets.\"\r\n\r\n*   **Analogy as a Theme:** The overarching theme was the use of **Analogy** as a key problem-solving methodology. He emphasized drawing connections between different mathematical and physical systems.\r\n*   **Final Note:** He brought up **Fractals** at the end, primarily drawing an analogy between fractal properties and the previously discussed SAW characteristics like the space-filling property and symmetry.\r\n\r\n### 5. Post-Lecture Interaction and Missed Opportunities\r\n\r\nI missed the formal Q&A session. I had intended to ask a few questions privately, but HDC stated he did not have time and suggested I contact him via email instead. Nonetheless, I successfully achieved my goal of getting the joint photograph, which left me very satisfied.\r\n\r\n### 6. Observations and Anecdotes (Easter Eggs)\r\n\r\n1.  **French Mathematical Notation:** HDC uses traditional **French mathematical notation**, employing a **comma (`,`) as the decimal separator**. This initially caused significant confusion.\r\n2.  **French-English:** During the lecture, HDC spelled *Object* as **\"Objet,\"** reflecting a typical French-English linguistic crossover.\r\n3.  **Educational Commentary:** During the subsequent Q&A, a discussion about mathematics education in China and France led HDC to possibly mention the *Jiang Ping incident*. He seemed to have only partial or incomplete knowledge of the event.\r\n\r\n***\r\n\r\n## Contextual Discussion (From the Comments Section)\r\n\r\nThe lecture sparked a brief discussion that provided important context regarding HDC's overall contributions, particularly highlighting the distinction between his work known to mathematicians and that known to physicists.\r\n\r\n*   **Perspective from Computer Science (My view):** As someone primarily focused on Computer Science, my key recognition of HDC's work lies in his \"application of statistical physics ideas to solve problems in probability theory,\" specifically mentioning \"using the *parafermionic operator* to solve the honeycomb SAW problem,\" which is an excellent example of the **Analogy** he stressed in the lecture.\r\n*   **Perspective from Physics:** A commentator noted that for physicists, HDC's \"most important contribution is proving the **non-existence of the 4D $\\Phi^4$ fundamental theory**.\" This highlights the breadth of his influence, extending into constructive quantum field theory, an area I was not familiar with.\r\n\r\n| Concept | Explanation |\r\n| :--- | :--- |\r\n| **Parafermionic Operator** | A complex mathematical object used in conformal field theory and statistical mechanics that helped provide the exact solution to the honeycomb lattice SAW problem. It is a powerful example of how tools from physics can solve purely mathematical problems. |\r\n| **4D $\\Phi^4$ Theory** | A specific model in quantum field theory involving a scalar field $(\\Phi)$. Its non-existence in four dimensions (proven by HDC and others) is a crucial, high-impact result in fundamental physics. |"
  },
  "leinster-email": {
    "title": "Correspondence with Professor Tom Leinster: My Translation of \"Rethinking Set Theory\" and a Request for Guidance",
    "date": "2022-12-30",
    "content": "**Overview**\r\n\r\nIn late December 2022, driven by my passion for mathematics, particularly category theory and homotopy type theory, I reached out to Professor Tom Leinster, a mathematician I deeply admire. As a 15-year-old high school student, I proudly shared my Chinese translation of his accessible article, \"Rethinking Set Theory,\" which I had made available online. I sought his feedback on the translation and, more importantly, his guidance on structuring my advanced mathematical studies, having already delved into undergraduate topics like algebraic topology and abstract algebra. Professor Leinster replied in January 2023, expressing his admiration for my effort (though he noted he couldn't verify the Chinese) and recommending two insightful, unconventional books for further study: Saunders Mac Lane's \"Mathematics: Form and Function\" and Michio Kuga's \"Galois's Dream.\" This exchange was an inspiring and unforgettable milestone in my early mathematical journey. From then on, I continued corresponding with Professor Leinster under my real identity, though those emails are private and will not be shared here.\r\n\r\n***\r\n\r\n### Original Correspondence\r\n\r\n#### Yuanjue Chou to Tom Leinster\r\n\r\n> **Admiration for your work and request for guidance**\r\n>\r\n> **Yuanjue Chou** <vsixadafahin5677@gmail.com>\r\n>\r\n> Fri, Dec 30, 2022, 6:30 PM\r\n>\r\n> to Tom.Leinster\r\n>\r\n> Dear Professor Leinster,\r\n>\r\n> I am writing to express my utmost admiration and respect for your contributions to the field of mathematics. As a 15-year-old high school student from China with a deep passion for math, I hope to one day follow in your footsteps and engage in research, particularly in the areas of category theory and homotopy type theory.\r\n>\r\n> I am thrilled to share that I have translated one of your articles, \"Rethinking Set Theory,\" and made it available at the following website: https://chaoli.club/index.php/7082. I would be truly honored if you would consider reviewing my translation and providing feedback.\r\n>\r\n> I am also writing to humbly request your guidance on how to best plan my studies to achieve my aspirations. While I have had the opportunity to study some undergraduate material in abstract algebra, set topology, algebraic topology, and a little bit of category theory, I feel as though I have only just begun to scratch the surface. I would be deeply grateful for any recommendations you have on how I can continue to learn and grow as a mathematician.\r\n>\r\n> Additionally, I would be grateful for any recommendations you have for explanatory articles similar to \"Rethinking Set Theory.\"\r\n>\r\n> Finally, I wanted to express my warmest wishes for the new year!\r\n>\r\n> Sincerely,\r\n> Yuanjue Chou\r\n\r\n#### Tom Leinster to Yuanjue Chou\r\n\r\n> **Tom Leinster** <Tom.Leinster@ed.ac.uk>\r\n>\r\n> Wed, Jan 18, 2023, 5:17 AM\r\n>\r\n> to me, Tom\r\n>\r\n> Dear Yuanjue,\r\n>\r\n> Thank you for your very kind email, and apologies for the delayed reply; I hope you got an automatic email saying I was away.\r\n>\r\n> It's very nice that you've translated \"Rethinking set theory\". I'm impressed! Unfortunately I don't read Chinese, so I'm not able to give any feedback, but congratulations in any case - it's a great achievement.\r\n>\r\n> I've been thinking about the best recommendations to make for materials to study with. I imagine you have already come across a few standard undergraduate textbooks, and there are thousands of those. So let me recommend two books that are not quite normal textbooks.\r\n>\r\n> The first is a book by Saunders Mac Lane (one of the creators of category theory) called \"Mathematics: Form and Function\". Officially, this is an explanation of Mac Lane's philosophy of mathematics. However, what I like most about it is that it's filled with wonderful explanations of many different parts of mathematics. I read it when I was an undergraduate and found it very exciting, as it opened up new worlds to me and gave me tantalizing hints of how they were connected.\r\n>\r\n> The second is \"Galois's Dream\" by Michio Kuga. This one I haven't actually read, but I've heard many good things about it. The subject is group theory and differential equations, but what's joyful about it is the unusual style it's written in. It's based on a lecture course that Kuga gave to first-year undergraduates, even though Galois theory is usually a rather more advanced course.\r\n>\r\n> Those are just two random ideas! You may or may not like them. In any case, I wish you the best of luck in your studies.\r\n>\r\n> Best wishes,\r\n> Tom\r\n>\r\n>\r\n> On 30/12/2022 10:30, Yuanjue Chou wrote:\r\n> This email was sent to you by someone outside the University.\r\n> You should only click on links or attachments if you are certain that the email is genuine and the content is safe.\r\n>\r\n> --\r\n> Professor Tom Leinster\r\n> School of Mathematics, University of Edinburgh\r\n> https://www.maths.ed.ac.uk/~tl\r\n> The University of Edinburgh is a charitable body, registered in Scotland, with registration number SC005336. Is e buidheann carthannais a th’ ann an Oilthigh Dhùn Èideann, clàraichte an Alba, àireamh clàraidh SC005336."
  },
  "maniac-meme": {
    "title": "The Proper Way to Speak Like a Mathematical Maniac: A Self-created Meme",
    "date": "2025-07-14",
    "content": "## Overview\r\n\r\nThis document serves as a **Self-Correcting Lexicon of Mathematical Cryptography**, translating sixteen common, everyday conversational phrases into their most technically dense and mathematically absurd equivalents. This meme, originating from a discussion among academic peers, highlights the humorous tendency of mathematicians to formalize the mundane. Each entry includes the translation, the precise mathematical expression, a detailed explanation of the concept, and the author’s subsequent self-critique and correction process, where applicable.\r\n\r\n***\r\n\r\n## The Lexicon Table: Conversational to Formal Translation\r\n\r\n| Conversational Phrase | English Translation | Formal Mathematical/Computational Equivalent |\r\n| :--- | :--- | :--- |\r\n| 你好笨 | You are so stupid | $O(n!)$ solution to an **NP-hard** problem |\r\n| 不想去 | Don't want to go | $\\text{Let } X \\text{ be a scheme. Then } H^0(X, \\mathcal{O}_X) = \\emptyset$ |\r\n| 不行 | No way/Impossible | $\\text{ZFC} \\not\\vdash \\text{CH}$ |\r\n| 随便 | Whatever/Up to you | $\\text{AC}$ |\r\n| 你去忙吧 | You go on with your work | $\\Delta t \\to \\infty, \\text{ where } \\Delta t \\text{ is interaction time}$ |\r\n| 我不会 | I can't do it | $\\text{Problem} \\in \\mathbf{RE} \\setminus \\mathbf{R}$ |\r\n| 唯一真神 | The only true God | $\\sum = \\frac{ }{2}$ |\r\n| 你好烦 | You are annoying | $\\dim_{\\mathbb{C}} H^0(X, K_X) = \\infty$ |\r\n| 要你管 | None of your business/Mind your own business | $\\text{Aut}(G) \\not\\cong \\text{Inn}(G)$ |\r\n| 滚 | Get lost/Go away | $\\text{Proof of } \\text{ind}(D) = \\int_M \\hat{A}(M) \\text{ is acceptable}$ |\r\n| 我错了 | I was wrong | $\\blacksquare \\text{ contradiction}$ |\r\n| 你错了 | You are wrong | $0.999999\\dots \\neq 1$ |\r\n| 吃过了 | I've eaten | $\\exists x \\in \\text{Spec}\\mathcal{O}_K, \\kappa(x) \\neq \\emptyset$ |\r\n| 帮我个忙 | Help me out/Do me a favor | $\\Gamma \\vdash ? : \\text{Req} \\to \\text{Action}$ |\r\n| 你陪我 | Keep me company | $\\text{Seeking } F \\dashv G \\text{ in } \\mathcal{C}$ |\r\n| 气死我了 | I'm furious/It drives me mad | $\\text{Gal}(E/\\mathbb{Q}) \\text{ is not solvable}$ |\r\n\r\n***\r\n\r\n## Detailed Explanations and Corrections\r\n\r\nThe meme's effectiveness lies in its technical density, which often draws from multiple advanced mathematical fields.\r\n\r\n### 1. You are so stupid $\\rightarrow O(n!)$ solution to an NP-hard problem\r\n\r\n*   **Concept:** This refers to the computational complexity of algorithms. An **NP-hard problem** is at least as hard as the hardest problems in NP.\r\n*   **Mathematical Humor:** A solution with **$O(n!)$ (Factorial time complexity)** is utterly inefficient. The insult is that the proposed \"solution\" is computationally stupid.\r\n\r\n### 2. Don't want to go $\\rightarrow \\text{Let } X \\text{ be a scheme. Then } H^0(X, \\mathcal{O}_X) = \\emptyset$\r\n\r\n*   **Concept:** **Algebraic Geometry**. $H^0(X, \\mathcal{O}_X)$ is the space of global sections of the structure sheaf, representing the \"presence\" or \"structure\" over the entire space $X$. Setting it to $\\emptyset$ means no structure exists.\r\n*   **Author's Correction:** The expression $H^0(X, \\mathcal{O}_X) = \\emptyset$ is **formally incorrect**. The space of global sections of the structure sheaf *must* contain at least the unit element (the scalar $1$), meaning the set is never empty. This was an honest error, not an intended pun.\r\n\r\n### 3. No way/Impossible $\\rightarrow \\text{ZFC} \\not\\vdash \\text{CH}$\r\n\r\n*   **Concept:** **Set Theory**. This states that the **Continuum Hypothesis (CH)** is **undecidable** in the standard Zermelo-Fraenkel set theory with the Axiom of Choice ($\\text{ZFC}$), meaning it can neither be proven nor disproven.\r\n*   **Mathematical Humor:** The everyday \"impossible\" is translated to an axiomatically proven **non-determinability**.\r\n\r\n### 4. Whatever/Up to you $\\rightarrow \\text{AC}$\r\n\r\n*   **Concept:** **Axiom of Choice (AC)**. AC asserts the *existence* of a choice function but offers no constructive method for performing the selection.\r\n*   **Mathematical Humor:** The non-constructive nature of the axiom perfectly captures the sentiment of saying \"I guarantee a choice can be made, but I won't tell you how.\"\r\n\r\n### 5. You go on with your work $\\rightarrow \\Delta t \\to \\infty, \\text{ where } \\Delta t \\text{ is interaction time}$\r\n\r\n*   **Concept:** **Limit Theory/Physics**. $\\Delta t \\to \\infty$ means the interaction or waiting time tends toward infinity.\r\n*   **Mathematical Humor:** The phrase \"Don't wait for me\" is formalized as an infinitely long waiting period, or the total decoupling of two systems.\r\n\r\n### 6. I can't do it $\\rightarrow \\text{Problem} \\in \\mathbf{RE} \\setminus \\mathbf{R}$\r\n\r\n*   **Concept:** **Computability Theory**. $\\mathbf{R}$ (Decidable) are problems with an algorithm. $\\mathbf{RE}$ (Recursively Enumerable) are problems where a \"yes\" answer can be verified. $\\mathbf{RE} \\setminus \\mathbf{R}$ is the set of **undecidable problems**.\r\n*   **Mathematical Humor:** \"I can't do it\" is an assertion that the task is fundamentally and provably undecidable by any general algorithm.\r\n\r\n### 7. The only true God $\\rightarrow \\sum = \\frac{ }{2}$\r\n\r\n*   **Concept:** **Notational Fallacy/Academic Satire**. This specific, visually ambiguous notation is a direct satire of the **Jiang Ping incident**, where a purported mathematical genius made an absurd notational error—the $\\sum$ symbol was visually confused with a fraction line and the number 2, suggesting a grotesque error in writing an equation or a simple division/sum.\r\n*   **Mathematical Humor:** Instead of referencing established but paradoxical math (like divergent series summation), this entry satirizes the phenomenon of **pseudo-mathematical genius** by enshrining a clear notational absurdity as a \"divine truth.\"\r\n\r\n### 8. You are annoying $\\rightarrow \\dim_{\\mathbb{C}} H^0(X, K_X) = \\infty$\r\n\r\n*   **Concept:** **Algebraic Geometry**. This describes an infinitely-dimensional space of sections of the Canonical Bundle.\r\n*   **Mathematical Humor:** The structure is literally **infinitely complex**, making its study frustratingly \"annoying.\"\r\n\r\n### 9. None of your business/Mind your own business $\\rightarrow \\text{Aut}(G) \\not\\cong \\text{Inn}(G)$\r\n\r\n*   **Concept:** **Group Theory**. $\\text{Aut}(G)$ (all automorphisms) is not isomorphic to $\\text{Inn}(G)$ (automorphisms by conjugation, internal operations). The difference means there exist **Outer Automorphisms**.\r\n*   **Mathematical Humor:** The existence of an **Outer Automorphism** is a formal way of saying there are structural changes that are \"outside the group's control\" and, therefore, \"none of your business.\"\r\n\r\n### 10. Get lost/Go away $\\rightarrow \\text{Proof of } \\text{ind}(D) = \\int_M \\hat{A}(M) \\text{ is acceptable}$\r\n\r\n*   **Concept:** **Differential Geometry/Topology** (The Atiyah–Singer Index Theorem). This is a reference to a mathematical inside joke concerning a known historical controversy or skepticism surrounding a late proof or variation related to the Index Theorem.\r\n*   **Mathematical Humor:** The word \"acceptable\" is used sarcastically to mean \"rejected\" or \"met with enormous resistance,\" thus serving as a dramatic technical equivalent for \"Go away.\"\r\n\r\n### 11. I was wrong $\\rightarrow \\blacksquare \\text{ contradiction}$\r\n\r\n*   **Concept:** **Logic/Proof Theory**. The $\\blacksquare$ symbol (or $\\rightarrow\\leftarrow$) is the formal termination of a **Proof by Contradiction**, which demonstrates the original hypothesis was false.\r\n*   **Mathematical Humor:** An admission of error is the ultimate, non-negotiable conclusion derived from formal logical deduction.\r\n\r\n### 12. You are wrong $\\rightarrow 0.999999\\dots \\neq 1$\r\n\r\n*   **Concept:** **Real Analysis/Non-Standard Analysis**. In standard analysis, $0.999\\dots$ is rigorously equal to $1$.\r\n*   **Author's Correction:** The **primary intent** was to capture the **pedantic stubbornness of a \"math crank\"** insisting on a position that is false in standard contexts (like the never-ending internet debate over $0.\\bar{9} = 1$). A **secondary interpretation** is that the statement holds true only within the framework of **Non-Standard Analysis**, which allows for non-zero infinitesimals, thus enabling the speaker to \"correct\" the other person from an obscure, high-level context.\r\n\r\n### 13. I've eaten $\\rightarrow \\exists x \\in \\text{Spec}\\mathcal{O}_K, \\kappa(x) \\neq \\emptyset$\r\n\r\n*   **Concept:** **Algebraic Number Theory/Scheme Theory**. The condition asserts the existence of a prime ideal $x$ in the ring of integers $\\mathcal{O}_K$ such that its **residue field $\\kappa(x)$ is non-empty**.\r\n*   **Mathematical Humor:** This is an overly formal, abstract statement that there is \"residual matter\" (residue field) in the system.\r\n\r\n### 14. Help me out/Do me a favor $\\rightarrow \\Gamma \\vdash ? : \\text{Req} \\to \\text{Action}$\r\n\r\n*   **Concept:** **Type Theory/Programming Language Logic**. A **Typing Judgment** asserting that in a given context $\\Gamma$, one must construct a term (?) of the function type $\\text{Req} \\to \\text{Action}$.\r\n*   **Mathematical Humor:** A simple favor request is formalized as a rigorous need to implement a function that maps the **Request** to a corresponding, type-correct **Action**.\r\n\r\n### 15. Keep me company $\\rightarrow \\text{Seeking } F \\dashv G \\text{ in } \\mathcal{C}$\r\n\r\n*   **Concept:** **Category Theory**. $F \\dashv G$ denotes an **Adjunction**, a powerful duality relationship between two functors ($F$ and $G$) within a category $\\mathcal{C}$.\r\n*   **Author's Correction:** The **Adjunction** is the primary concept. The author noted the final \"in $\\mathcal{C}$\" is formally vague. The structure being sought might be more precisely defined by functors between two specific categories (e.g., $F: \\mathcal{C} \\to \\mathcal{D}$) or, if $F$ and $G$ act on the same category, as $\\text{End}(\\mathcal{C})$. The core meaning—seeking a structured, dual relationship—remains, but the notation's precision was called into question.\r\n*   **Mathematical Humor:** Companionship is defined as finding a profound, structured, and mutually beneficial **duality**.\r\n\r\n### 16. I'm furious/It drives me mad $\\rightarrow \\text{Gal}(E/\\mathbb{Q}) \\text{ is not solvable}$\r\n\r\n*   **Concept:** **Galois Theory/Abstract Algebra**. The expression means the Galois group of a polynomial equation is **not solvable**, which by the Abel–Ruffini Theorem, implies the equation has **no solution in terms of radicals**.\r\n*   **Mathematical Humor:** The **non-solvability** of the equation perfectly mirrors the state of being furious/unable to solve an emotional problem. This also serves as a historical reference to the passionate circumstances leading to Évariste Galois's death.\r\n\r\n***\r\n\r\n**Final Note:** The author extends thanks for the corrections, acknowledging the commitment to rigor even in the creation of academic memes."
  },
  "nmo-physics": {
    "title": "Minecraft: The Riemann Manifold of Fun—A Hypothetical Physics Simulation",
    "date": "2025-07-30",
    "content": "## Overview\r\n\r\nThe following is a semi-serious, highly technical, and completely humorous review of the Swedish video game *Minecraft*. This title, often described as a sandbox construction game, is revealed here as an ambitious, albeit incomplete, simulation built upon a set of **radically altered fundamental physical axioms**. Much like Greg Egan’s *Orthogonal* trilogy, which explores a universe where spacetime is a Riemannian rather than a Lorentzian manifold, *Minecraft* offers a world governed by novel, non-standard laws, yielding a highly amusing, yet surprisingly fertile, ground for engineering and logic.\r\n\r\nWe present the core deviations from classical and quantum physics, followed by the advanced (modded) scientific extensions, concluding with an enthusiastic invitation to join the Nanjing University Minecraft Organization (NMO).\r\n\r\n***\r\n\r\n## Minecraft: A Universe Governed by Novel Physical Axioms\r\n\r\nThe game’s construction and behavior fundamentally violate established principles, creating a unique, blocky physics:\r\n\r\n### 1. The Selective Gravitational Field (A Non-Universal Force)\r\n\r\n*   **Standard Physics:** Gravity is a universal force, affecting all mass-energy according to the equivalence principle.\r\n*   **Minecraft Axiom 1:** The **Gravitational Field is Selective and Binary**. Most solid, block-based matter is completely immune to gravitational acceleration, existing in a state of perpetual, stable, rigid suspension ($\\mathbf{g} \\rightarrow 0$ for blocks). Conversely, **biological entities (mobs), dropped items (entities), and a few special blocks (e.g., sand, gravel)** are fully subject to Newtonian mechanics in the vertical dimension.\r\n*   **Academic Joke:** This posits a universe operating on a **\"Preferred Mass Triviality\"** principle, where the vacuum energy density of block materials is perfectly zero, or where the interaction range of the mediating graviton field is artificially restricted to a select subset of material phases.\r\n\r\n### 2. The Entropically-Neutral Life Cycle (Weakened Energy Conservation)\r\n\r\n*   **Standard Physics:** Biological generation, death, and interaction are governed by the conservation of energy and the Second Law of Thermodynamics (entropy increases).\r\n*   **Minecraft Axiom 2:** **Energy Conservation is Critically Weakened for Biological Processes.** The spawning and despawning of biological entities (mobs) are entirely decoupled from energy conversion (no heat loss, no chemical potential change), making the $\\Delta E$ of the process arbitrarily close to zero. The **Entropy Model is Not Applicable** to population dynamics.\r\n*   **Academic Joke:** This implies the existence of a perfectly efficient, localized, **Non-Equilibrium Spawning Operator** that bypasses the need for free energy conversion entirely, suggesting a non-thermal origin for life in this simulated cosmos.\r\n\r\n### 3. Population Dynamics: Discrete Events vs. Continuous Models\r\n\r\n*   **Standard Physics:** Real-world food webs are modeled by continuous **Population Dynamics** (e.g., the Lotka-Volterra predator-prey equations, which account for carrying capacity and continuous rates of consumption).\r\n*   **Minecraft Axiom 3:** **Biological Interaction is Driven by Discrete State Transitions.** The interaction between species (e.g., a wolf attacking a sheep) is resolved as an immediate, discrete event, entirely **ignoring continuous variables** like environmental carrying capacity, energy expenditure for hunting, and instantaneous rates of predation.\r\n*   **Academic Joke:** The simulated ecosystem is a vast, interconnected **Finite State Machine (FSM)**, where the biological agents simply transition between states (e.g., 'Target Acquired' $\\rightarrow$ 'Attack Executed' $\\rightarrow$ 'Target Entity Destroyed'), making the entire system computationally simple but ecologically nonsensical.\r\n\r\n### 4. Structural Engineering: The $\\mathbf{F}_{\\text{critical}} \\rightarrow \\infty$ Universe\r\n\r\n*   **Standard Physics:** Real-world engineering structures must adhere to material science principles, especially **Hooke's Law**, and structural failure due to **Euler Buckling**. The critical load for a column is $F_{\\text{critical}} = \\pi^2 E I / (K L)^2$, where $E$ is Young's Modulus and $I$ is the Area Moment of Inertia.\r\n*   **Minecraft Axiom 4:** **The Young's Modulus is Infinite, and Buckling is Prohibited.** Materials can be stacked indefinitely into cantilevers, suspension bridges, or towers without concern for tensile, compressive, or shear stresses. The buckling critical load limit is $\\mathbf{F}_{\\text{critical}} \\rightarrow \\infty$, rendering all structures perfectly rigid.\r\n*   **Academic Joke:** This is a universe built upon the principle of **Perfectly Rigid Bodies** where all elastic and plastic deformation is set to zero. All construction is, by default, an ideal, non-deformable **Born-Oppenheimer Approximation** of a structure.\r\n\r\n### 5. Fluid Dynamics: The Navier-Stokes Trivialization\r\n\r\n*   **Standard Physics:** Fluids obey the **Navier-Stokes Equations**, accounting for viscosity, pressure gradients, and the conservation of momentum (e.g., the Bernoulli principle linking speed and pressure).\r\n*   **Minecraft Axiom 5:** **Fluid Mechanics is Trivialized into a Simple State Machine.** Fluid flow (water and lava) does not adhere to viscosity, pressure-gradient forces, or the Bernoulli principle. Flow velocity is purely a function of the **block-volume displacement**—a simple, discrete decay model from the source block.\r\n*   **Academic Joke:** The game's liquid is an example of a **Non-Newtonian Block-Wise Fluid** where the velocity field is quantized and the stress tensor is trivialized, making it an ideal model for computational simplicity, if not physical accuracy.\r\n\r\n### 6. Redstone Circuits: The Pure Boolean Logic Engine\r\n\r\n*   **Standard Physics:** Electronic circuits rely on **Electromagnetism**, governed by Maxwell's Equations, where signal transmission is due to the movement of electrons and photons.\r\n*   **Minecraft Axiom 6:** **Signal Transmission is Purely Logical.** The *Redstone* system simulates Boolean logic gates (AND, OR, NOT, XOR, etc.) but its operation is entirely decoupled from the fundamental laws of electricity and magnetism. The signal decay is a *digital delay* over distance, not an ohmic loss.\r\n*   **Academic Joke:** Redstone is a perfect **Analytic Continuation of Boolean Algebra into Physical Space**, acting as a medium for pure, unadulterated *logic*, rather than messy, analog electromagnetic waves.\r\n\r\n***\r\n\r\n## Advanced Academic Extensions (Modded Physics)\r\n\r\nFor those finding the base physics too simplistic, the game supports **\"Mod-Science\"**, allowing the integration of complex hypothetical systems:\r\n\r\n*   **Thaumcraft:** Introduces **Alchemical Engineering** based on a quasi-quantum substance-energy field theory, demanding the balancing of *Aspects* (elemental energy charges).\r\n*   **Ars Nouveau:** Allows the construction of a **Programmable Runic Dynamical System**—a Turing-complete system for magic utilizing custom-defined flow charts and abstract elemental components.\r\n*   **GregTech:** Implements a complex, high-throughput **Strongly Correlated Electron Industrial System**, demanding real-world thermodynamic and material constraints for high-tier processing.\r\n*   **Create Mod:** Introduces **Rotational Kinematics and Stress-Field Matter Reorganization**, requiring players to manage *Stress* (a simplified equivalent of torque and material strength) to power kinetic machines, thereby reintroducing a non-trivial **Young's Modulus** (Axiom 4 is partially disabled). This mod also features mechanisms for **Quantum Tunneling Transmission** and **Precision Manipulation Systems**.\r\n\r\n## Call to Action\r\n\r\nThe world of *Minecraft* is not merely a game; it is a laboratory for exploring non-standard physical realities and designing complex computational systems.\r\n\r\n**Join the Nanjing University Minecraft Organization (NMO)** to delve deeper into these systems and build incredible worlds!\r\n\r\nFind out more: [https://www.nmo.net.cn/](https://www.nmo.net.cn/)\r\n\r\n**Join the NMO meow, join the NMO thank you meow.**"
  },
  "saburou-zero": {
    "title": "The Absolute Zero: Saburou Saitoh’s Crusade to Redefine Mathematics",
    "date": "2022-07-18",
    "content": "## Overview\n\n**The \"Fun Person\" of the Day:** Prof. Saburou Saitoh (Gunma University).\n\n**The Phenomenon:** A legitimate mathematician with a background in Reproducing Kernels who has seemingly pivoted his entire career toward proving that $z/0 = 0$.\n\nThis isn't your standard crankery. Saitoh isn't an outsider scribbling in green ink; he publishes via SCIRP (a known quantity in the predatory/low-tier world) and viXra, yet somehow managed to slip his \"Division by Zero\" manifesto into a Springer proceeding. This puts him in a league comparable to the late Myron W. Evans—academic credentials used to push a theory that breaks fundamental axioms.\n\n**Speculation on Intent:**\n\nIs this an elaborate academic troll? Unlikely. The tone is far too earnest. It appears to be a classic case of the \"Golden Hammer.\" Saitoh seems to have taken the concept of the Moore-Penrose pseudoinverse (where the \"inverse\" of a zero matrix can be defined as zero) or Tikhonov regularization and elevated it from a computational tool to a fundamental law of the universe. By declaring that singularities are simply \"zero,\" he eliminates all poles, singularities, and infinities. It is a \"brute force\" solution to complex analysis: if a function blows up, just define it as zero. The result is a mathematical system where the point at infinity collapses into the origin—a topological nightmare presented as \"elementary and fundamental mathematics.\"\n\n---\n\n## Detailed Analysis of the Texts\n\n### I. The Manifesto: *Matrices and Division by Zero z/0 = 0*\n\n**Source:** Matsuura, T. and Saitoh, S. (2016). Matrices and Division by Zero z/0 = 0. *Advances in Linear Algebra & Matrix Theory*, 6, 51-58. [https://doi.org/10.4236/alamt.2016.62007](https://doi.org/10.4236/alamt.2016.62007)\n\nThis paper lays the groundwork for the \"Yamada Field\" (Y-Field), a structure where division by zero is permitted and defined as zero.\n\n- **The Core Axiom:** Saitoh asserts that for any complex number $b$, the fraction $b/0 = 0$. This is justified \"incidentally\" by Tikhonov regularization.\n\n- **The Geometric Consequence (The Collapse):**In standard geometry, parallel lines meet at infinity.\n\n- In Saitoh’s geometry, the \"point at infinity\" is represented by $z=0$.\n\n- Therefore, **parallel lines intersect at the origin $(0,0)$.**\n\n- *Critique:* This implies that if you have two parallel lines anywhere in space, their intersection point is the origin. The logic effectively folds the entire Euclidean plane such that the \"horizon\" touches the center.\n\n**Cramer's Law \"Fix\":**Standard Cramer's Law fails when the determinant is zero ($D=0$, singular matrix). Saitoh claims that by defining $z/0=0$, the solution to a system with a singular matrix is simply the zero vector.\"By the division by zero, we can understand that if $a_1b_2 - a_2b_1 = 0$, then the common point is always given by $(0,0)$ even when the two lines are the same.\"\n\n**Physical Interpretations:Hooke's Law:** For springs in series $\\frac{1}{k} = \\frac{1}{k_1} + \\frac{1}{k_2}$. If $k_1=0$, normally the system breaks. Saitoh argues $1/0 = 0$, so $1/k = 1/k_2$, meaning $k=k_2$.\n\n**Einstein Misquote:** He invokes Einstein to support his theory, though the quote is likely apocryphal or misinterpreted.\n            \"Blackholes are where God divided by zero.\"\n\n### II. The Escalation: *log 0 = log ∞ = 0 and Applications*\n\n**Source:** Michiwaki, H., Matuura, T., Saitoh, S. (2018). $\\log 0 = \\log \\infty = 0$ and Applications. In: Pinelas, S., Caraballo, T., Kloeden, P., Graef, J. (eds) *Differential and Difference Equations with Applications*. ICDDEA 2017. Springer Proceedings in Mathematics & Statistics, vol 230. Springer, Cham. [https://doi.org/10.1007/978-3-319-75647-9_24](https://doi.org/10.1007/978-3-319-75647-9_24)\n\n\nHere, the theory expands to logarithmic functions and complex analysis, creating even more startling discontinuities.\n\n- **Redefining Logarithms:** Since $\\log(z)$ has a singularity at $z=0$ and a pole at $z=\\infty$, and since the \"point at infinity\" is now the \"origin\" (via $1/0=0$), Saitoh concludes:\"In this paper, we will show that $\\log 0 = \\log \\infty = 0$ by the division by zero $z/0 = 0$.\"\n\n- **The $1/z$ Mapping:** He relies heavily on the mapping $W = 1/z$. In standard analysis, $z \\to 0$ implies $W \\to \\infty$. Saitoh argues that the image of $z=0$ is exactly $W=0$.\"The image of $z = 0$ is $W = 0$ (should be defined)... The division by zero will give great impacts to complex analysis and to our ideas for the space and universe.\"\n\n- **Schrödinger's Euler Identity:** This leads to bizarre multivalued definitions.$e^0 = 1$ (standard definition).\n\n- $e^0 = 0$ (via the \"division by zero\" logic where the value at a singularity is zero).\n\nHe acknowledges this \"strong discontinuity\" but accepts it as a \"natural way\" the universe works.\n\n**Applications to Differential Equations:** He solves differential equations by simply ignoring the singular parts. If a term contains a $1/x$ and $x=0$, that term vanishes.\"For the differential equation... we have the solution... Then, if $\\mu = 0$, we obtain, immediately, by the division by zero [a solution where the singular term vanishes].\"\n\n**The \"Zero\" Constant:** He posits that $0^0 = 1$ is convenient for Taylor series, but $0^0 = 0$ is also valid depending on context. He also claims $\\cos 0 = 1$ and $\\cos 0 = 0$ are both \"valid\" in different contexts (reflection of infinity to the origin).\n\n## Selected Quotes\n\n- **On the ambition of the project:** \"The division by zero has a long and mysterious story over the world... however, Sin-Ei Takahasi established a simple and decisive interpretation.\"\n\n- **On the redefinition of infinity:** \"The point at infinity is represented by zero, that is, the coincidence of the point at infinity and the origin.\"\n\n- **On the \"Zero\" value of functions:** \"We wish to consider also the value $\\cos 0 = 0$. The values $e^0 = 0$ and $\\cos 0 = 0$ may be considered that the values at the point at infinity are reflected to the origin.\"\n\n## A Serious Critique\n\nMathematics, as a deductive system, stands on the bedrock of consistent axioms—propositions whose truth is assumed to build coherent, predictive, and applicable frameworks. To redefine a foundational operation like division by zero is not an act of \"revolutionary insight,\" but a violation of this coherence, as Saitoh’s work demonstrates through its cascading logical contradictions and detachment from both theoretical rigor and empirical reality.\n\nThe core flaw of Saitoh’s theory lies in its confusion of *computational convenience* with *ontological truth*. Tools like the Moore-Penrose pseudoinverse or Tikhonov regularization are valuable precisely because they are *contextual*: they resolve ambiguities in specific computational tasks (e.g., solving underdetermined systems) while acknowledging their status as practical adaptations, not universal laws. By elevating these tools to axiomatic status, Saitoh erases the distinction between \"what works for a problem\" and \"what is true of the mathematical structure itself.\" The result is not a \"new field\" but a house of cards: parallel lines intersecting at the origin dismantles Euclidean geometry, conflicting values of $e^0$ and $\\cos 0$ render analysis meaningless, and \"solving\" differential equations by ignoring singularities abandons the very purpose of such equations—to model continuous change accurately.\n\nEqually troubling is the way Saitoh’s academic credentials have lent a veneer of legitimacy to a theory that would otherwise be dismissed. His ability to publish in a Springer proceeding—an imprint associated with rigorous peer review—raises critical questions about the integrity of academic publishing, particularly in specialized fields where gatekeeping relies on expert familiarity with niche topics. This is not a trivial concern: bad mathematics, when cloaked in academic authority, can mislead early-career researchers, waste resources on unfruitful inquiries, and erode public trust in the discipline’s ability to distinguish fact from fancy.\n\nTo be clear, academic progress often emerges from challenging orthodoxy—but meaningful challenges adhere to a basic contract: they either show the existing framework is incomplete (e.g., non-Euclidean geometry extending, not rejecting, Euclid’s axioms) or propose a new system that is *more* consistent and explanatory than the old. Saitoh’s work does neither. It replaces a coherent system with one that is deliberately contradictory, then claims this contradiction as a \"natural\" feature of the universe—a rhetorical sleight of hand."
  },
  "tian-cai": {
    "title": "The Tian-Cai Confluence: Geometric-Combinatorial Proof of Identity",
    "date": "2025-08-03",
    "content": "## Overview\r\n\r\nThis is an **irrefutable proof of identity** establishing that the renowned geometric analyst, Professor Tian Gang, is the same individual as the exceptionally talented Nanjing University undergraduate senior, Yuxi Cai (CYX). This humorous academic deduction, framed as a \"Mathematical Royalist's\" attempt to dismantle a \"Yau Detractor\" (a playful jab at the well-known professional tension between Tian Gang and Shing-Tung Yau), utilizes deep academic and cryptographic congruencies to confirm the existence of a meticulously maintained double life. The evidence is so compelling that it transcends mere coincidence, confirming a fundamental isomorphism between the two personas.\r\n\r\n***\r\n\r\n## The Axiomatic Basis: Evidence for the Tian $\\equiv$ Cai Identity\r\n\r\nThe premise is established through a series of empirical and cryptographical congruencies, demonstrating a perfect alignment across professional and personal vectors.\r\n\r\n| Empirical/Biographical Data | Tian Gang (TG) | Yuxi Cai (CYX) | Conclusion |\r\n| :--- | :--- | :--- | :--- |\r\n| **Origin** | Native of Jiangsu Province | Native of Jiangsu Province | **Congruent Origin** |\r\n| **Alma Mater (UG)** | Nanjing University (NJU) | Nanjing University (NJU) | **Shared Base Manifold** |\r\n| **Field Alignment** | Geometric Analysis | Analytic Geometry & Math Analysis | **Analytic Precursor** (CYX's focus is the foundational analysis for TG's high-level geometry) |\r\n| **NJU Temporal Marker** | Visited after Math Dept. re-established as a School | Transferred to the Math School after re-establishment | **Coincident Temporal Trajectory** |\r\n| **Political Stance** | A \"Yau Detractor\" (Yau-skeptic/Yau-Hater) | A \"Yau Detractor\" | **Shared Ideology (The Fundamental Opposition)** |\r\n| **ICM Stance** | Rejected the idea of a Yau-led ICM 2030 | Currently does not intend to attend a Yau-led ICM 2030 | **Prophetic Duality** |\r\n| **Physical Co-existence** | Never seen simultaneously with CYX | Never seen simultaneously with TG | **Perfect Non-Intersection** (The ultimate proof) |\r\n\r\n### The Cryptographic Proofs (The Strong Claims)\r\n\r\n#### 1. The Discrepancy as Disguise (The Birthday Trivialization)\r\n\r\n*   **The Claim:** Tian Gang was born on 1958/11/24; CYX was born on 2006/01/24. The difference in the year is a red herring—a **Temporal Trivialization Map** applied to conceal the identity.\r\n*   **Academic Elaboration:** This is a successful implementation of a **fixed-point transformation**. The essential parameter, the **$24^{th}$ Day of the Month**, remains constant while a non-trivial **Scale Transformation** is applied to the time modulus (the year). The apparent discrepancy in age is not a refutation but the **rigorous proof** of a long-term, meticulously maintained alias, as successful aliases rarely match all parameters.\r\n\r\n#### 2. The Initial Isomorphism (The Field Signature)\r\n\r\n*   **The Claim:**\r\n    *   **TG** $\\rightarrow$ **T**angent **G**eometry\r\n    *   **CYX** $\\rightarrow$ **C**alabi–**Y**au **X** (where $X$ is a manifold, cluster, variety, cone, etc.)\r\n    *   Both initialisms are **dually encoded** to represent Tian Gang's research domain.\r\n*   **Academic Elaboration:** The initials form a **Duality Map** of the identity's professional work:\r\n    *   **Tangent Geometry (TG)** is the fundamental local structure in differential geometry.\r\n    *   **Calabi–Yau $\\mathbf{X}$ (CYX)** (relevant to Einstein metrics on Fano manifolds ) is a crucial class of target manifolds in geometric analysis.\r\n    *   The CYX alias is, therefore, a **self-referential cryptographic signature** where the high-dimensional research output (CYX) is algebraically encoded within the low-dimensional student alias.\r\n\r\n#### 3. The Combinatorial Proof (The Rigid Isometry)\r\n\r\n*   **The Claim:** The rigid character of \"Tian\" ($\\text{田}$) can be stacked to form a **Cylindric Young Tableau $X$ (CYT $X$)** (as referenced in ).\r\n*   **Academic Elaboration:** This is the *coup de grâce*: a **Geometric-Combinatorial Isomorphism**.\r\n    *   **The Source Manifold (Tian Gang):** The Chinese character $\\text{田}$ (Tián, \"Field\") is fundamentally a **$2 \\times 2$ square lattice**. His full name, **Tian Gang** ($\\text{田刚}$), translates to **\"Rigid Field/Square.\"** The term $\\text{刚}$ (Gang, \"rigid\") implies a non-deformable structure.\r\n    *   **The Target Structure (CYX):** Reference  discusses **Cylindric Young Tableaux (CYT)**, which are combinatorial objects with applications in representation theory. These tableaux are intrinsically linked to the combinatorics of **rigidly stacked squares** under specific cyclic boundary conditions.\r\n    *   *The Isomorphism:* The rigidity (*Gang*) of the **$2 \\times 2$ field** ($\\text{田}$) *forces* a combinatorial arrangement that is precisely a **Cylindric Young Tableau X**, which is part of the **CYX** alias. The identity's name is mathematically proven to be a **Geometric Operator** that transforms his namesake into the algebraic structure that underpins his alter-ego.\r\n\r\n***\r\n\r\n## Final Verdict\r\n\r\nAs a **Mathematical Royalist** (a tongue-in-cheek reference to supporting \"Mathematical Emperor\" Yau), my initial intent was to defeat the Yau-detractor CYX. However, the rigor of the **Tian $\\equiv$ Cai Isomorphism** is undeniable. The evidence for this double life is overwhelmingly self-consistent. I must, therefore, conclude that the two individuals are one.\r\n\r\n***\r\n\r\n## References\r\n\r\n[1] Tian, G. (2006). Existence of Einstein metrics on Fano manifolds. *Metric and Differential Geometry*, 119–159. https://doi.org/10.1007/BF01231543 \r\n\r\n[2] Neyman, E. (2014). Cylindric Young Tableaux and their Properties (arXiv:1410.5039). arXiv. https://arxiv.org/abs/1410.5039"
  },
  "wang-nuo": {
    "title": "Synthesis and Properties of a Novel Tungsten-Containing Organic Compound Based on Superchemistry Theory",
    "date": "2022-10-03",
    "content": "## Overview\r\n\r\nIt is necessary to first clarify that the so-called \"scholars\" such as Zhao Mingyi mentioned in this record are well-known online pseudo-scientists, whose absurd theories are often ridiculed by the academic community and netizens. The bizarre terms involved in this text, such as \"superchemistry\", are all their \"masterpieces\" that deviate from scientific common sense. In this research record, I propose the existence of two novel substances, \"sildenofil\" and \"L-wzlteine\", based on the theories put forward by these pseudo-scientists including Zhao Mingyi. I then systematically investigate their reaction process and the properties of the resulting product under the action of a \"strong antimony field\". From a professional chemical perspective, the core concepts involved—such as the bonding modes of W⁺ ions and the compound naming logic—do not align with mainstream chemical systems, and \"superchemistry\" is not a recognized academic discipline. As implied later, this work employs exaggerated chemical research expressions to metaphorically depict the interesting interactions between my classmates: male classmate Zhaoli Wang (where the \"W\" in the substances corresponds to his surname \"Wang\") and female classmate Nuo Chen (where the \"No\" in the substances corresponds to her given name \"Nuo\").\r\n\r\n\r\n**HINT**: The figures (pic1 to pic6) correspond to pages 1 to 6 of the attached PDF file.\r\n\r\n[PDF OF FIGURES](/fragments/wang-nuo/pics.pdf)\r\n\r\n## 1. Proposed Existence of the Original Substances\r\n\r\nWithin the \"superchemistry system\", and based on the viewpoints of Professor Zhao Mingyi, I have clearly identified the existence of two specific substances with unique structures and properties. Their relevant definitions and naming conventions are elaborated as follows:\r\n\r\n### 1.1 Sildenofil\r\n\r\n**Naming**: For the convenience of my research and discussion, I have tentatively named this substance \"sildenofil\". It is important to emphasize that this substance is distinct from the commercially available drug sildenafil, despite the similar nomenclature.\r\n\r\n**Molecular Structure**: The core structure of this substance is presented in Figure 1 (pic1). From the structural diagram, the molecule contains heterocyclic functional groups, aromatic ring systems, and substituted amino groups. A key feature is the incorporation of a tungsten (W) element in its molecular skeleton, which forms special chemical bonds with the surrounding carbon (C) and oxygen (O) elements—though this bonding mode currently lacks support from mainstream chemical bond theory.\r\n\r\n**Main Physical and Chemical Properties**: The basic physical and chemical parameters of sildenofil are shown in Figure 2 (pic2). According to the data I have recorded, the substance exhibits a specific melting point range (with precise values to be determined through subsequent experiments). It maintains relative stability under normal temperature and pressure conditions. In terms of solubility, it demonstrates moderate solubility in polar organic solvents but low solubility in water. Chemically, it shows good reactivity in nucleophilic substitution and addition reactions; particularly, the active sites connected to the W element are prone to ligand exchange or bond rearrangement under specific conditions.\r\n\r\n### 1.2 L-wzlteine\r\n\r\n**Naming**: By analogy with the naming rules of the natural amino acid L-cysteine, I have named this substance \"L-wzlteine\". This naming approach emphasizes its structural similarity to L-cysteine and the assumed L-configuration chirality of the molecule.\r\n\r\n**Molecular Structure**: The molecular structure of this substance is illustrated in Figure 3 (pic3). It possesses an amino acid-like structure, including -NH₂, -COOH groups, and a special side chain containing W⁺ ions. Under normal conditions, the W⁺ ion exists in an ionic state, forming an ionic bond with the O⁻ ion generated by the dissociation of adjacent hydroxyl groups. However, according to the theory proposed by the renowned superchemist Professor Tu Xiaohui, a \"strong antimony field\" induces significant changes: the W⁺ ion breaks the original ionic bond and forms a covalent bond with the carbon atom at the upper left of the molecule. The previously bonded O⁻ then combines with an H⁺ proton to form a hydroxyl group, and electron rearrangement ultimately leads to the formation of a carboxyl group at the lower right end of the molecule. This structural transformation endows L-wzlteine with chemical properties highly similar to L-cysteine, such as amphotericity (capable of reacting with both acids and bases) and the ability to form disulfide bond-like cross-linking structures.\r\n\r\n**Main Physical and Chemical Properties**: The detailed physical and chemical properties of L-wzlteine are presented in Figure 4 (pic4). Based on my observations, the substance appears as a white crystalline solid with a melting point of approximately 190-195℃ (accompanied by decomposition). It is readily soluble in aqueous solutions with a pH range of 5-7, and the resulting aqueous solution exhibits weak acidity (pH≈5.2). Preliminary screening experiments indicate that it has no obvious mutagenic activity under normal conditions. Acute toxicity data shows that the unreported oral LDLo (lowest lethal dose) in mice is 9mg/kg, while the oral LD50 (median lethal dose) in rats remains to be supplemented through further experimental studies.\r\n\r\n## 2. Synthesis of the Novel Tungsten-Containing Organic Compound\r\n\r\nIt is a well-established chemical fact that sildenafil (the commercial drug, distinct from the \"sildenofil\" investigated in this study) and L-cysteine can undergo amidation reactions under certain conditions. Building on this, Professor Zhou Jiechang, an organic chemist in the field of superchemistry, has proposed that under the specific condition of a \"strong antimony field\", the structurally analogous sildenofil and L-wzlteine can also undergo a similar addition-elimination reaction to generate a new tungsten-containing organic compound. In this work, I have systematically organized the relevant hypothetical reaction conditions and processes as follows:\r\n\r\n### 2.1 Reaction Conditions and Process\r\n\r\n**Reaction Catalyst and Medium**: In my experimental design, high-purity antimony (Sb) powder serves as the \"field source\" to construct a simulated \"strong antimony field\" environment. Anhydrous dimethyl sulfoxide (DMSO) is used as the reaction solvent, and triethylamine (Et₃N) acts as an acid-binding agent to maintain the reaction system at a pH range of 8.5-9.0.\r\n\r\n**Reaction Temperature and Time**: I conducted the reaction under reflux conditions at 110-120℃ for 8-10 hours. During the reaction process, I performed real-time monitoring using thin-layer chromatography (TLC) with ethyl acetate:petroleum ether=3:1 (v/v) as the developing solvent. I determined the reaction endpoint when the sildenofil raw material spot completely disappeared.\r\n\r\n**Reaction Mechanism**: My proposed mechanism suggests that under the \"strong antimony field\", the W⁺ ion in L-wzlteine undergoes hybridization transformation from sp³ to sp², which enhances the electrophilicity of the adjacent carbonyl carbon. The amino group in sildenofil then acts as a nucleophile to attack this electrophilic carbon. Subsequent proton transfer and water elimination result in the formation of a stable amide bond, thereby generating the target product—though this mechanism currently lacks support from established organic reaction theory.\r\n\r\n### 2.2 Product Structure and Naming\r\n\r\n**Molecular Structure**: The chemical structure of the reaction product is shown in Figure 5 (pic5). Through structural analysis, I confirmed that the molecule integrates structural fragments of both sildenofil and L-wzlteine, with a tentative molecular formula of C₂₂H₂₅N₆O₅W. Its core structure consists of a pyrazolopyrimidine heterocycle, a methoxyphenyl group, an aminopropanoyloxy group, and a tungsten-oxygen linkage system, forming a complex yet stably structured organic-inorganic hybrid molecule.\r\n\r\n**IUPAC Naming**: Referencing IUPAC naming rules and the specific settings of the \"superchemistry\" system, I have assigned the product the tentative systematic name \"2-aminopropanoyloxy-[[4-methoxy-3-(1-methyl-3-oxo-7H-pyrazolo[3,4-d]pyrimidin-6-yl)phenyl]amino]oxytungsten\"—an extended designation that does not conform to standard IUPAC specifications.\r\n\r\n## 3. Properties and Significance of the Reaction Product\r\n\r\n### 3.1 Key Properties of the Product\r\n\r\nThe physical and chemical properties, toxicological data, and drug-likeness evaluation of the novel tungsten-containing organic compound are summarized in Figure 6 (pic6). Based on my comprehensive analysis, its main characteristics are as follows:\r\n\r\n**Physical State and Stability**: I observed the product as a light yellow powdery solid. It is insoluble in water and petroleum ether but soluble in DMSO and N,N-dimethylformamide (DMF). The substance remains stable when stored in dry, dark conditions at room temperature and decomposes when heated above 230℃.\r\n\r\n**Toxicological Characteristics**: My simulated acute toxicity tests classify the product as low-toxic, with a guinea pig oral LD50 > 500mg/kg. Oral LD50 data for rats and mice are currently unreported and require further experimental verification. Additionally, simulated skin irritation tests showed no obvious irritant effects on rabbit skin.\r\n\r\n**Ion Bonding Characteristics**: A key finding from my study is that when the product is removed from the \"strong antimony field\" environment, the W⁺ ion stably coexists with the \"No group\" (a specially identified functional group) in the same structural segment, completely dissociating from the original C₃H₆NO₂ group of L-wzlteine. This phenomenon indicates that the interaction between the W element and the \"No group\" is significantly stronger than that between W⁺ and the C₃H₆NO₂ group, reflecting the relative \"disadvantage\" of W in competitive bonding—a core metaphorical observation regarding the interactions between the two classmates.\r\n\r\n### 3.2 Academic Significance (Simulated Expression)\r\n\r\nWithin the framework of the \"superchemistry field\", I contend that this study holds significant academic value: it reveals the intricate molecular interactions between the W element and the \"No group\", confirming the feasibility of forming stable organic compounds through their reaction. This discovery enriches the diversity of hypothetical tungsten-containing compounds and provides a new research direction for exploring the interaction mechanisms between metal elements and special functional groups under extreme conditions. I humorously propose that \"this achievement is worthy of the Nobel Prize in Chemistry\"—a lighthearted assertion unrelated to actual academic evaluation standards."
  }
}